[
 {
   "ID": 153,
   "Year": 2014,
   "Title": "The Hybrid Artisans: A Case Study in Smart Tools",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara,  Joseph Paradis",
   "Abstract": "We present an approach to combining digital fabrication and craft, demonstrating a \n\thybrid interaction paradigm where human and machine work in synergy. \n\tThe FreeD is a hand-held digital milling device, monitored \n\tby a computer while preserving the makers freedom to manipulate the work in many creative ways. [...]",
   "DOI": "http://doi.acm.org/10.1145/2617570",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/hybridartisan_tochi2014.jpg"
 },
 {
   "ID": 210,
   "Year": 2009,
   "Title": "The ModelCraft framework: Capturing freehand annotations and edits to facilitate the 3D model design process using a digital pen",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Hyunyoung Song, François Guimbretière,  Hod Lipso",
   "Abstract": "ModelCraft supports a wide range of operations on complex models, \n\tfrom editing a model to assembling multiple models, and offers physical tools to \n\tcapture free-space input. Several interviews and a formal study with the potential \n\tusers of our system proved the ModelCraft system useful. Our system is inexpensive, \n\trequires no tracking infrastructure or per object calibration, \n\tand we show how it could be extended seamlessly to use current 3D printing technology. [...]",
   "DOI": "http://dx.doi.org/10.1145/1592440.1592443",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/modelcraft_tochi2009.jpg"
 },
 {
   "ID": 34,
   "Year": 2017,
   "Title": "Facade: Auto-generating Tactile Interfaces to Appliances",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Anhong Guo, Jeeeun Kim, Xiang 'Anthony' Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, Jeffrey P. Bigha",
   "Abstract": "We introduce Facade—a crowdsourced fabrication pipeline to help blind people inde¬ pendently make physical interfaces accessible by adding a 3D printed augmentation of tactile buttons overlaying the original panel. \n\tFacade users capture a photo of the appliance with a readily available fiducial marker (a dollar bill) for recovering size information. \n\tThis image is sent to multiple crowd workers, who work in parallel to quickly label and describe elements of the interface. \n\tFacade then generates a 3D model for a layer of tactile and pressable buttons that fits over the original controls.  \n\t[...]",
   "DOI": "https://doi.org/10.1145/3025453.3025845",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Guo_CHI2017.jpg"
 },
 {
   "ID": 35,
   "Year": 2017,
   "Title": "EdiPulse: Investigating a Playful Approach to Self-monitoring through 3D Printed Chocolate Treats",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Rohit Ashok Khot, Deepti Aggarwal, Ryan Pennings, Larissa Hjorth, Florian ‘Floyd’ Muelle",
   "Abstract": "We introduce EdiPulse a novel system that creates activity treats to offer playful reflections on everyday physical activity through the appealing medium of chocolate. \n\tEdiPulse translates self-monitored data from physical activity into small 3D printed chocolate treats. \n\tDetermination, Affection, and Co-experience. We conclude by highlighting key implications of our work for future playful food-based technology design in supporting the experience of being physically active.  \n\t[...]",
   "DOI": "https://doi.org/10.1145/3025453.3025980",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Khot_CHI2017.jpg"
 },
 {
   "ID": 36,
   "Year": 2017,
   "Title": "Transformative Appetite",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Wen Wang, Lining Yao, Chin-Yi Cheng, Teng Zhang, Daniel Levine, Hiroshi Ishi",
   "Abstract": "We developed a concept of transformative appetite, where edible 2D films made of common food materials (protein, cellulose or starch) can transform into 3D food during cooking. \n\tThis transformation process is triggered by water adsorption, and it is strongly compatible with the 'flat packaging' concept for substantially reducing shipping costs and storage space. \n\tTo develop these transformable foods, we performed material-based design, established a hybrid fabrication strategy, and conducted performance simulation.  \n\t[...]",
   "DOI": "https://doi.org/10.1145/3025453.3026019",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Wang_CHI2017.jpg"
 },
 {
   "ID": 37,
   "Year": 2017,
   "Title": "Cardboard Machine Kit: Modules for the Rapid Prototyping of Rapid Prototyping Machines",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Nadya Peek, James Coleman, Ilan Moyer, Neil Gershenfeld",
   "Abstract": "We propose a novel set of modules, the Cardboard Machine Kit, for the construction of digital fabrication machines. \n\tThese open-source modules are implemented using cardboard frames, stepper motors, and networked electronics controlled through a Python library. \n\tWe evaluated the kit both through machine building workshops and by studying the usage of the kit in the wild.  [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025491",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Peek_CHI2017.jpg"
 },
 {
   "ID": 38,
   "Year": 2017,
   "Title": "WireDraw: 3D Wire Sculpturing Guided with Mixed Reality",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Ya-Ting Yue, Xiaolong Zhang, Yongliang Yang, Gang Ren, Yi-King Choi, Wenping Wang",
   "Abstract": "We present a mixed reality system, called `WireDraw', to immersively guide the 3D drawing for easy wire sculpturing. \n\tThe system design is based on novel 3D drawing principles and the subsequent optimization, making the stroke sequence of the wire model drawable and easy to draw. \n\tOn-the-fly edits on unsatisfactory strokes are also allowed for creative design.  [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025792",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yue_CHI2017.jpg"
 },
 {
   "ID": 39,
   "Year": 2017,
   "Title": "Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Harpreet Sareen, Udayan Umapathi, Patrick Shin, Yasuaki Kakehi, Jifei Ou, Pattie Maes, Hiroshi Ishii",
   "Abstract": "Printflatables is a design and fabrication system for human-scale, functional and dynamic inflatable objects. \n\tWe use inextensible thermoplastic fabric as the raw material with the key principle of introducing folds and thermal sealing. \n\tUpon inflation, the sealed object takes the expected three dimensional shape. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025898",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Sareen_CHI2017.jpg"
 },
 {
   "ID": 40,
   "Year": 2017,
   "Title": "Pineal: Bringing Passive Objects to Life with Embedded Mobile Devices",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "David Ledo, Fraser Anderson, Ryan Schmidt, Lora Oehlberg, Saul Greenberg, Tovi Grossman",
   "Abstract": "To mitigate this, we created Pineal, a design tool that lets end-users: (1) modify 3D models to include a smart watch or phone as its heart; (2) specify high-level interactive behaviours through visual programming; and (3) have the phone or watch act out such behaviours as the objects' \"smarts\". \n\tFurthermore, a series of prototypes show how Pineal exploits mobile sensing and output, and automatically generates 3D printed form-factors for rich, interactive, objects. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025652",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Ledo_CHI2017.jpg"
 },
 {
   "ID": 41,
   "Year": 2017,
   "Title": "TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, Patrick Baudisch",
   "Abstract": "We present TrussFab, an integrated end-to-end system that allows users to fabricate large scale structures that are sturdy enough to carry human weight. \n\tTrussFab achieves the large scale by complementing 3D print with plastic bottles. It does not use these bottles as \"bricks\" though, \n\tbut as beams that form structurally sound node-link structures, also known as trusses, allowing it to handle the forces resulting from scale and load. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3026016",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Kovacs_CHI2017.jpg"
 },
 {
   "ID": 42,
   "Year": 2017,
   "Title": "ProtoMold: An Interactive Vacuum Forming System for Rapid Prototyping",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Junichi Yamaoka, Yasuaki Kakehi",
   "Abstract": "We propose a novel fabrication machine called ProtoMold, which uses interactive vacuum forming system for rapid prototyping. \n\tProtoMold combines a dynamical shape-changing surface that consists of 12 × 8 linear actuators and a vacuum forming system. \n\tAccording to the shape of the surface, this system can mold various 2.5 dimensional objects quickly. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025498",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yamaoka_CHI2017.jpg"
 },
 {
   "ID": 43,
   "Year": 2017,
   "Title": "Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, Max Mühlhäuse",
   "Abstract": "We introduce Flexibles: 3D-printed flexible tangibles that are deformation-aware and operate on capacitive touchscreens. \n\tFlexibles add expressive deformation input to interaction with on-screen tangibles. \n\tBased on different types of deformation mapping, we contribute a set of 3D-printable mechanisms that capture pressing, squeezing, and bending input with multiple levels of intensities.  [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025663",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Schmitz_CHI2017.jpg"
 },
 {
   "ID": 44,
   "Year": 2017,
   "Title": "Digital Mechanical Metamaterials",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Alexandra Ion, Ludwig Wall, Robert Kovacs, Patrick Baudisch",
   "Abstract": "We explore how to embody mechanical computation into 3D printed objects, i.e., without electronic sensors, actuators, or controllers typically used for this purpose. \n\tA key benefit of our approach is that the resulting objects can be 3D printed in one piece and thus do not require assembly. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025624",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Alexandar_CHI2017.jpg"
 },
 {
   "ID": 45,
   "Year": 2017,
   "Title": "Stretching the Bounds of 3D Printing with Embedded Textiles",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Michael L. Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, Scott E. Hudson",
   "Abstract": "Combining 3D printing and textiles opens up new opportunities for rapidly creating rigid objects with embedded flexibility as well as soft \n\tmaterials imbued with additional functionality. We introduce a suite of techniques for integrating 3D printing with textiles \n\tduring the printing process, opening up a new design space that takes inspiration from both fields. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025460",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Revira_CHI2017.jpg"
 },
 {
   "ID": 46,
   "Year": 2017,
   "Title": "Electrick: Low-Cost Touch Sensing Using Electric Field Tomography",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Yang Zhang, Gierad Laput, Chris Harriso",
   "Abstract": "We show that our technique is compatible with commonplace manufacturing methods, such as spray/brush coating, \n\tvacuum forming, and casting/molding enabling a wide range of possible uses and outputs. Our technique can also \n\tbring touch interactivity to rapidly fabricated objects, including those that are laser cut or 3D printed. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025842",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yang_CHI2017.jpg"
 },
 {
   "ID": 47,
   "Year": 2017,
   "Title": "WireFab: Mix-Dimensional Modeling and Fabrication for 3D Mesh Models",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Min Liu, Yunbo Zhang, Jing Bai, Yuanzhi Cao, Jeffrey Alperovich, Karthik Raman",
   "Abstract": "The WireFab is designed to allow the user to choose how to best preserve the fidelity of the \n\ttopological structure and articulation motion while selectively maintaining the fidelity of the geometric \n\tappearance. Compared to 3D-printing based high-fidelity fabrication systems, WireFab increases prototyping \n\tspeed by ignoring unnecessary geometric details while preserving structural integrity and articulation motion. [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025619",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Min_CHI2017.jpg"
 },
 {
   "ID": 48,
   "Year": 2017,
   "Title": "WeaveMesh: A Low-Fidelity and Low-Cost Prototyping Approach for 3D Models Created by Flexible Assembly",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Ye Tao, \tGuanyun Wang, \tCaowei Zhang, \tNannan Lu, \tXiaolian Zhang, \tCheng Yao, \tFangtian Yin",
   "Abstract": "To meet the increasing requirements of HCI researchers who are prototyping a variety of forms to create novel interfaces under a ubiquitous situation, we present WeaveMesh, a low-fidelity and low-cost rapid prototyping system that produces 3D objects in a mesh structure. Inspired by hand-weaving craft, WeaveMesh supports a highly customizable software platform, which is applicable for simulating and facilitating freeform surface constructions composed of woven [...]",
   "DOI": "https://doi.org/10.1145/3025453.3025699",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/weavemesh.jpg"
 },
 {
   "ID": 85,
   "Year": 2016,
   "Title": "DefSense: Computational Design of Customized Deformable Input Devices",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Moritz Bächer, Benjamin Hepp, Fabrizio Pece, Paul G. Kry, Bernd Bickel, Bernhard Thomaszewski, Otmar Hilliges",
   "Abstract": "We propose to embed piezoresistive sensing elements into flexible 3D printed objects. These sensing elements are then utilized to recover rich and natural user interactions at runtime. Designing such objects manually is a challenging and hard problem for all but the simplest geometries and deformations. Our method simultaneously optimizes the internal routing of the sensing elements and computes a mapping from low-level sensor readings to user-specified outputs in order to minimize reconstruction error. [...]",
   "DOI": "https://doi.org/10.1145/2858036.2858354",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Moritz_CHI2016.jpg"
 },
 {
   "ID": 86,
   "Year": 2016,
   "Title": "CardBoardiZer: Creatively Customize, Articulate and Fold 3D Mesh Models",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Yunbo Zhang, Wei Gao, Luis Paredes, Karthik Ramani",
   "Abstract": "This paper presents CardBoardiZer, a rapid cardboard based prototyping platform that allows everyday sculptural \n\t3D models to be easily customized, articulated and folded. We develop a building platform to allow the designer to \n\t1) import a desired 3D shape, 2) customize articulated partitions into planar or volumetric foldable patterns, \n\tand 3) define rotational movements between partitions.  [...]",
   "DOI": "https://doi.org/10.1145/2858036.2858362",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yunbo_CHI2017.jpg"
 },
 {
   "ID": 87,
   "Year": 2016,
   "Title": "ExoSkin: On-Body Fabrication",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Madeline Gannon, Tovi Grossman,  George Fitzmauric",
   "Abstract": "We present ExoSkin, a hybrid fabrication system for designing and printing digital artifacts directly on the body. ExoSkin utilizes a custom built fabrication machine designed specifically for on-body printing. ExoSkin utilizes a custom built fabrication machine designed specifically for on-body printing. We demonstrate the potential of on-body fabrication with a set of sample workflows, and share feedback from initial observation sessions. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858576",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/exoskin_chi2016.jpg"
 },
 {
   "ID": 88,
   "Year": 2016,
   "Title": "The Hybrid Bricolage: Bridging Parametric Design with Craft through Algorithmic Modularity",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Tamara Anna Efrat, Moran Mizrahi,  Amit Zora",
   "Abstract": "Our hypothesis is that the arrangement of parametric design in modular representation, in the form of a catalog, can assist makers unfamiliar with this practice. We evaluate this assumption in the realm of bag design, through a Honeycomb Smocking Pattern Catalog and custom Computer-Aided Smocking (CAS) design software. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?doid=2858036.2858441",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/hybridbricolage_chi2016.jpg"
 },
 {
   "ID": 89,
   "Year": 2016,
   "Title": "Foldem: Heterogeneous Object Fabrication via Selective Ablation of Multi-Material Sheets",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Varun Perumal C, Daniel Wigdo",
   "Abstract": "oldem, a novel method of rapid fabrication of objects with multi-material properties is presented. Our specially formulated Foldem sheet allows users to fabricate and easily assemble objects with rigid, bendable, and flexible properties using a standard laser-cutter. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858135",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/foldam_chi2016.png"
 },
 {
   "ID": 90,
   "Year": 2016,
   "Title": "Steel-Sense: Integrating Machine Elements with Sensors by Additive Manufacturing",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Tatyana Vasilevitsky, Amit Zora",
   "Abstract": "We present Steel-Sense, an approach to joining these two families of elements to create a new type of HCI design primitive. We leverage recent developments in 3D printing to embed sensing in metal structures that are otherwise difficult to equip with sensors, and present four design principles, implementing. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858309",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/steelsense_chi2016.jpg"
 },
 {
   "ID": 91,
   "Year": 2016,
   "Title": "xPrint: A Modularized Liquid Printer for Smart Materials Deposition",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Guanyun Wang, Lining Yao, Wen Wang, Jifei Ou, Chin-Yi Cheng,  Hiroshi Ishi",
   "Abstract": "To meet the increasing requirements of HCI researchers who are looking into using liquid-based materials (e.g., hydrogels) to create novel interfaces, we present a design strategy for HCI researchers to build and customize a liquid-based smart material printing platform with off-the-shelf or easy-to-machine parts. For the hardware, we suggest a magnetic assembly-based modular design. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858281",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/xprint_chi2016.jpg"
 },
 {
   "ID": 92,
   "Year": 2016,
   "Title": "ChronoFab: Fabricating Motion",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Rubaiat Habib Kazi, Tovi Grossman, Cory Mogk, Ryan Schmidt,  George Fitzmauric",
   "Abstract": "We present ChronoFab, a 3D modeling tool to craft motion sculptures, tangible representations of 3D animated models, visualizing an object's motion with static, transient, ephemeral visuals that are left behind. Our tool casts 3D modeling as a dynamic art-form by employing 3D animation and dynamic simulation for the modeling of motion sculptures. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858138",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/chronofab_chi2016.jpg"
 },
 {
   "ID": 93,
   "Year": 2016,
   "Title": "What you Sculpt is What you Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Michael D. Jones, Kevin Seppi,  Dan R. Olse",
   "Abstract": "We present a method for fabricating prototypes of interactive computing devices from clay sculptures without requiring the designer to be skilled in CAD software. The method creates a \"what you sculpt is what you get\" process that mimics the \"what you see is what you get\" processes used in interface design for 2D screens. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858493",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/wsc_chi2016.jpg"
 },
 {
   "ID": 94,
   "Year": 2016,
   "Title": "HotFlex: Post-print Customization of 3D Prints Using Embedded State Change",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Daniel Groeger, Elena Chong Loo,  Jürgen Steiml",
   "Abstract": "We propose HotFlex: a new approach allowing precisely located parts of a 3D object to transition on demand from a solid into a deformable state and back. This approach enables intuitive hands-on remodeling, personalization, and customization of a 3D object after it is printed. We introduce the approach and present an implementation based on computer-controlled printed heating elements that are embedded within the 3D object. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858191",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/hotflex_chi2016.jpg"
 },
 {
   "ID": 95,
   "Year": 2016,
   "Title": "RetroFab: A Design Tool for Retrofitting Physical Interfaces using Actuators, Sensors and 3D Printing",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Raf Ramakers, Fraser Anderson, Tovi Grossman,  George Fitzmauric",
   "Abstract": "We present RetroFab, an end-to-end design and fabrication environment that allows non-experts to retrofit physical interfaces. Our approach allows for changing the layout and behavior of physical interfaces. Unlike customizing software interfaces, physical interfaces are often challenging to adapt because of their rigidity. With RetroFab, a new physical interface is designed that serves as a proxy interface for the legacy controls that are now operated using actuators. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858485",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/retrofab_chi2016.jpg"
 },
 {
   "ID": 96,
   "Year": 2016,
   "Title": "On-The-Fly Print: Incremental Printing While Modelling",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Huaishu Peng, Rundong Wu, Steve Marschner,  François Guimbretièr",
   "Abstract": "In this paper we propose On-the-Fly Print: a 3D modeling approach that allows the user to design \n\t3D models digitally while having a low-fidelity physical wireframe model printed in parallel. \n\tOur software starts printing features as soon as they are created and updates the physical model as needed. [...]",
   "DOI": "https://doi.org/10.1145/2858036.2858106",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/ontheflyprint_chi2016.jpg"
 },
 {
   "ID": 97,
   "Year": 2016,
   "Title": "Cilllia: 3D Printed Micro-Pillar Structures for Surface Texture, Actuation and Sensing",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis,  Hiroshi Ishi",
   "Abstract": "This work presents a method for 3D printing hair-like structures on both flat and curved surfaces. \n\tIt allows a user to design and fabricate hair geometries that are smaller than 100 micron. \n\tWe built a software platform to let users quickly define the hair angle, thickness, density, and height. [...]",
   "DOI": "https://doi.org/10.1145/2858036.2858257",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cilllia_chi2016.png"
 },
 {
   "ID": 98,
   "Year": 2016,
   "Title": "Destructive Games: Creating Value by Destroying Valuable Physical Objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "David Eickhoff, Stefanie Mueller,  Patrick Baudisc",
   "Abstract": "We present a series of games that result in valuable physical objects being destroyed objects owned by the players. Interestingly, we found that we can design these games to be desirable to play, despite the loss of the object, by instead producing social value.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2858113",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/destructivegames.jpg"
 },
 {
   "ID": 99,
   "Year": 2016,
   "Title": "Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Nathaniel Hudson, Celena Alcock,  Parmit K. Chilan",
   "Abstract": "We present a study of casual makers, users who have no prior experience with fabrication and mainly explore walk-up-and-use 3D printing services at public print centers, such as libraries, universities, and schools. We carried out 32 interviews with casual makers, print center operators, and fabrication experts to understand the motivations, workflows, and barriers in appropriating 3D printing technologies. [...]",
   "DOI": "https://doi.org/10.1145/2858036.2858266",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/underto3d_chi2016.jpg"
 },
 {
   "ID": 126,
   "Year": 2015,
   "Title": "Acoustruments: Passive, Acoustically-Driven Interactive Controls for Hand Held Devices",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, Chris Harrison",
   "Abstract": "We introduce Acoustruments: low-cost, passive, and powerless mechanisms, made from plastic, that can bring rich, tangible functionality to handheld devices. Through a structured exploration, we identified an expansive vocabulary of design primitives, providing building blocks for the construction of tangible interfaces utilizing smartphones’ existing audio functionality. [...]",
   "DOI": "https://doi.org/10.1145/2702123.2702414",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Gierad_CHI2015.jpg"
 },
 {
   "ID": 127,
   "Year": 2015,
   "Title": "3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison,  Scott E. Hudso",
   "Abstract": "We explore 3D printing physical controls whose tactile response can be manipulated programmatically through pneumatic actuation. \n\tWe introduce and discuss a series of example 3D printed pneumatic controls, which demonstrate the feasibility of our approach. This includes conventional controls, \n\tsuch as buttons, knobs and sliders, but also extends to domains such as toys and deformable interfaces. [...]",
   "DOI": "http://dx.doi.org/10.1145/2702123.2702569",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/pneumatic_chi2015.jpg"
 },
 {
   "ID": 128,
   "Year": 2015,
   "Title": "Lamello: Passive Acoustic Sensing for Tangible Input Components",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore,  Wilmot L",
   "Abstract": "We describe Lamello, an approach for creating tangible input components that recognize user interaction \n\tvia passive acoustic sensing. \n\tLamello employs comb-like structures with varying-length tines at interaction points (e.g., along slider paths). \n\tOur main contributions are in the co-design of the tine structures, information encoding schemes, and audio analysis. [...]",
   "DOI": "http://dx.doi.org/10.1145/2702123.2702207",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/lamello_chi2015.jpg"
 },
 {
   "ID": 129,
   "Year": 2015,
   "Title": "Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen,  Patrick Baudisc",
   "Abstract": "This paper presents Platener, a system that allows quickly fabricating intermediate design iterations of 3D models, a process also known as low-fidelity fabrication. Platener achieves its speed-up by extracting straight and curved plates from the 3D model and substituting them with laser cut parts of the same size and thickness. Only the regions that are of relevance to the current design iteration are executed as full-detail 3D prints. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2601157",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/platener.jpg"
 },
 {
   "ID": 130,
   "Year": 2015,
   "Title": "D-Coil: A Hands-on Approach to Digital 3D Models Design",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Huaishu Peng, Amit Zoran,  François Guimbretièr",
   "Abstract": "We introduce D-Coil, a new digital 3D modeling approach using wax coiling to bring tangibility to \n\tthe design of digital models. After defining a shape to extrude, \n\tthe users follow the lead of a hand-held actuated extruder to instantiate the actual extrusion using wax. [...]",
   "DOI": "http://dx.doi.org/10.1145/2702123.2702381",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/dcoil_chi2015.jpg"
 },
 {
   "ID": 131,
   "Year": 2015,
   "Title": "Low-Fidelity Fabrication: Speeding up Design Iteration of 3D Objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Stefanie Mueller, Dustin Beyer, Tobias Mohr, Serafima Gurevich, Alexander Teibrich, Lisa Pfistere, Kerstin Guenther, Johannes Frohnhofen, Hsiang-Ting Chen, Patrick Baudisch, Sangha Im,  François Guimbretièr",
   "Abstract": "Low-fidelity fabrication systems speed up rapid prototyping by printing intermediate versions of a prototype as fast, low-fidelity previews. Only the final version is fabricated as a full high-fidelity 3D print. \n\tThis allows designers to iterate more quickly-achieving a better design in less time. [...]",
   "DOI": "http://dx.doi.org/10.1145/2702613.2725429",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/lff_chi2015.jpg"
 },
 {
   "ID": 132,
   "Year": 2015,
   "Title": "A Layered Fabric 3D Printer for Soft Interactive Objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson,  James McCan",
   "Abstract": "We present a new type of 3D printer that can form precise, \n\tbut soft and deformable 3D objects from layers of off-the-shelf fabric. Our printer employs an approach where \n\ta sheet of fabric forms each layer of a 3D object. The printer cuts this sheet along the 2D contour of the layer \n\tusing a laser cutter and then bonds \n\tit to previously printed layers using a heat sensitive adhesive.  [...]",
   "DOI": "http://dx.doi.org/10.1145/2702123.2702327",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/lf3d_chi2015.png"
 },
 {
   "ID": 154,
   "Year": 2014,
   "Title": "MixFab: a mixed-reality environment for personal fabrication",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar,  Hans W. Gellerse",
   "Abstract": "In this paper, we introduce MixFab, a mixed-reality environment for personal fabrication \n\tthat lowers the barrier for users to engage in personal fabrication. Users design objects in an \n\timmersive augmented reality environment, interact with virtual objects \n\tin a direct gestural manner and can introduce existing physical objects effortlessly into their designs. [...]",
   "DOI": "http://dx.doi.org/10.1145/2556288.2557090",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/mixfab_chi2014.jpg"
 },
 {
   "ID": 155,
   "Year": 2014,
   "Title": "faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen,  Patrick Baudisc",
   "Abstract": "We present a new approach to rapid prototyping of functional objects, such as the body of a head-mounted display. \n\tThe key idea is to save 3D printing time by automatically substituting sub-volumes with standard building blocks'in our case Lego bricks. \n\tWhen making the body for a head-mounted display, for example, getting the optical path right is paramount. [...]",
   "DOI": "http://dx.doi.org/10.1145/2556288.2557005",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabrick_chi2014.jpg"
 },
 {
   "ID": 156,
   "Year": 2014,
   "Title": "Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Scott E. Hudso",
   "Abstract": "This paper considers the design, construction, and example use of a new type of 3D printer which \n\tfabricates three-dimensional objects from soft fibers (wool and wool blend yarn). \n\tThe resulting objects recreate the geometric forms specified in the solid models which specify them, \n\tbut are soft and flexible -- somewhat reminiscent in character to hand knitted materials. [...]",
   "DOI": "http://dx.doi.org/10.1145/2556288.2557338",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/printedteddybear_chi2014.jpg"
 },
 {
   "ID": 178,
   "Year": 2013,
   "Title": "FreeD: a freehand digital sculpting tool",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Amit Zoran, Joseph A. Paradis",
   "Abstract": "In this paper, we present an approach to combining digital fabrication and craft, \n\temphasizing the user experience. While many researchers strive to enable makers to \n\tdesign and produce 3D objects, our research seeks to present a new fabrication \n\tapproach to make unique, one-of-a-kind artifacts. \n\tTo that end, we developed the FreeD, a hand-held digital milling device. [...]",
   "DOI": "http://dx.doi.org/10.1145/2470654.2481361",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/freed_chi2013.jpg"
 },
 {
   "ID": 179,
   "Year": 2013,
   "Title": "LaserOrigami: laser-cutting 3D objects",
   "Organization": "ACM",
   "Conference": "ACM CHI",
   "Authors": "Stefanie Mueller, Bastian Kruck,  Patrick Baudisc",
   "Abstract": "We present LaserOrigami, a rapid prototyping system that produces 3D objects using a laser cutter. LaserOrigami is substantially faster than traditional 3D fabrication techniques such as 3D printing and unlike traditional laser cutting the resulting 3D objects require no manual assembly. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2380190",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/laserorigami.jpg"
 },
 {
   "ID": 49,
   "Year": 2017,
   "Title": "infoTexture: Incremental Interfaces on Mesh Prototyping",
   "Organization": "ACM",
   "Conference": "ACM CHI EA",
   "Authors": "Caowei Zhang, \tGuanyun Wang, \tYe Tao, \tXuan Li, \tXin Liu, \tChuqi Tang, \tCheng Yao, \tFangtian Yin",
   "Abstract": "In recent years, the rapid prototyping of 3D objects has been a popular research, which mainly focusing on the fabrication process of prototypical structures and shapes. However, relatively little research has examined the surface texture of 3D models. To meet the increasing requirements of HCI researchers who are prototyping 3D forms with information on the surfaces to build multivariate interfaces, we present infoTexture, a novel rapid prototyping system that produces 3D objects both in a mesh structure and covered by a surface texture simultaneously. [...]",
   "DOI": "https://doi.org/10.1145/3027063.3053124",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/infoTexture.jpg"
 },
 {
   "ID": 33,
   "Year": 2017,
   "Title": "Joinery: Parametric Joint Generation for Laser Cut Assemblies",
   "Organization": "ACM",
   "Conference": "ACM Creativity and Cognition",
   "Authors": "Clement Zheng, Ellen Yi-Luen Do,  Jim Budd",
   "Abstract": "Laser cutting is widely used by industrial designers and mechanical engineers as a rapid modeling tool. However, designing and fabricating laser cut assemblies can be a complex and tedious process, especially for novice designers. \n\tThrough our research, we developed Joinery, a parametric joint generation tool for laser cut assemblies. Through Joinery, designers simply define connections between parts of an assembly, while the system generates the joints. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3059454.3059459",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Zheng_CC2017.jpg"
 },
 {
   "ID": 125,
   "Year": 2015,
   "Title": "MetaMorphe: Designing Expressive 3D Models for Digital Fabrication",
   "Organization": "ACM",
   "Conference": "ACM Creativity and Cognition",
   "Authors": "Cesar Torres, Eric Paulo",
   "Abstract": "We introduce MetaMorphe, a novel digital fabrication framework that uses a common web-programming metaphor \n\tto enable users to easily transform static 3D models into re-formed, re-made, and re-imagined customized personal \n\tartifacts. We demonstrate the compatibility of MetaMorphe with three well-established design interfaces, \n\tdirection manipulation, scripted-CAD, and generative design. [...]",
   "DOI": "http://dx.doi.org/10.1145/2757226.2757235",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/metamorphe_cc2015.jpg"
 },
 {
   "ID": 14,
   "Year": 2017,
   "Title": "Understanding Uncertainty in Measurement and Accommodating its Impact in 3D Modeling and Printing",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Jeeeun Kim, Anhong Guo, Tom Yeh, Scott E. Hudson,  Jennifer Mankof",
   "Abstract": "We demonstrate that measurement errors are a significant (yet often overlooked) challenge for end users through a systematic study of the sources and types of measurement errors. We argue for a new design principle--accommodating measurement error--that designers, as well as novice modelers, should to use at design time. We offer two strategies--buffer insertion and replacement of minimal parts--to help designers, as well as novice modelers, to build models that are robust to measurement error. We argue that these strategies can reduce the need for and costs of iteration and demonstrate their use in a series of printed objects. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3064663.3064690",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Kim_DIS2017.JPG"
 },
 {
   "ID": 15,
   "Year": 2017,
   "Title": "AnimSkin: Fabricating Epidermis with Interactive, Functional and Aesthetic Color Animation",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Yanan Wang, Shijian Luo, Yujia Lu, Hebo Gong, Yexing Zhou, Shuai Liu,  Preben Hanse",
   "Abstract": "ndividuals could also customize aesthetic graphic designs by following the detailed fabrication process to achieve personalized patterns. We propose four different dynamic types of color animation by applying certain voltage to the heating circuitry. With two examples, Email Reminder and Light Control System, we demonstrate how AnimSkin can be integrated into everyday life, and specifically, we show how AnimSkin can benefit areas such as on-skin design, thin-film interface and beauty technology.\n\t[...]",
   "DOI": "https://doi.org/10.1145/3064663.3064687",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/AnimSkin_DIS2017.jpg"
 },
 {
   "ID": 53,
   "Year": 2016,
   "Title": "Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "David A. Mellis, Leah Buechley, Mitchel Resnick,  Björn Hartman",
   "Abstract": "We describe a six-session workshop in which eight participants made wifi-connected devices through the design and fabrication of custom printed circuit boards. We explore the implications of using components and processes analogous to those in commercial products, as opposed to the limited set of higher-level building blocks found in toolkits for hobbyist electronics. We highlight unique advantages and challenges of a personal fabrication approach. We explore the role of attitudes in identifying a suitable audience for these activities. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901833",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/David_DIS2016.jpg"
 },
 {
   "ID": 54,
   "Year": 2016,
   "Title": "Productive Frictions: Moving from Digital to Material Prototyping and Low-Volume Production for Design Research",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Ron Wakkary, Henry Lin, Shannon Mortimer, Lauren Low, Audrey Desjardins, Keith Doyle,  Philip Robbin",
   "Abstract": "We focus on the lessons we learned from the challenges and design opportunities that arose in moving from digital processes to ceramic processes. We reflected on these lessons and developed thematic notions we refer to as frictions. These include shifting constraints, naive expertise, manual automation, and dynamic materiality. The contributions of this paper are new design insights into the combination of digital and material processes for studio based prototyping and low-volume production and adds to the emerging relevance of digital fabrication, physical fabrication, and physical materials to interaction design and HCI research. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901880",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Ron_DIS2016.jpg"
 },
 {
   "ID": 55,
   "Year": 2016,
   "Title": "3D Folded PrintGami: Transforming Passive 3D Printed Objects to Interactive by Inserted Paper Origami Circuits",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Claudia Daudén Roquet, Jeeeun Kim,  Tom Ye",
   "Abstract": "In this paper, we introduce a process of integrating paper circuit into a 3D printed object, combining two universal fabrication techniques, 3D printing and paper crafting: 1) design a hollow 3D model, 2) construct circuits on the 2D planar cutout of this figure, 3) pause 3D printing to insert folded circuits in, 4) resume to continue printing. We empower makers and tinkerers to employ pervasive technology to build interactive 3D objects without hacking machine, obtaining professional utilities, or buying expensive materials. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901891",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Roquet_DIS2016.jpg"
 },
 {
   "ID": 56,
   "Year": 2016,
   "Title": "Probing the Potential of Post-Anthropocentric 3D Printing",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Laura Devendorf, Abigail De Kosnik, Kate Mattingly,  Kimiko Ryoka",
   "Abstract": "We describe how existing designs can be seen as anthropocentric, framing the human maker as visionary and commander of passive machines and materials. We then present an alternative system for 3D printing, called Redeform, which explores how a post-anthropocentric framing of makers as collaborators with machines and materials changes the design of 3D printers. We place our system within a lineage of performances that have explored relationships between humans and nonhumans since the 1950s. In doing so, we explore and speculate on the opportunities for operationalizing post-anthropocentric theories within the specific context of the maker movement. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901879",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Laura_DIS2016.jpg"
 },
 {
   "ID": 57,
   "Year": 2016,
   "Title": "ProxyPrint: Supporting Crafting Practice through Physical Computational Proxies",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Cesar Torres, Wilmot Li,  Eric Paulo",
   "Abstract": "We investigate how DF artifacts can function as static intermediary tools, which we term proxies, to support crafting practice. We focus on the wire-wrapping process where physical wire is bent into complex shapes and build DF fixtures to aid with construction and fabrication. We explore how these proxies can be generated to provide users with different levels-of-assistance and evaluate how these proxies affect the making process. We show that our proxies affect quality and speed and yield different making experiences between novice and expert craftspeople. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901828",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Torres_DIS2016.jpg"
 },
 {
   "ID": 58,
   "Year": 2016,
   "Title": "FusePrint: A DIY 2.5D Printing Technique Embracing Everyday Artifacts",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Kening Zhu, Alexandru Dancu,  Shengdong (Shen) Zha",
   "Abstract": "Based on our polynomial model on 2.5D resin printing, we developed the design interface of FusePrint, which allows users to design the printed shapes using physical objects as references, generates projection patterns, and notifies users when to place the objects in the resin during the printing process. Our workshops suggested that FusePrint is easy to learn and use, provides a greater level of interactivity, and could be useful for a wide range of applications domains including: mechanical fabrication, wearable accessory, toys, interactive systems, etc. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2901790.2901792",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Zhu_DIS2016.jpg"
 },
 {
   "ID": 135,
   "Year": 2014,
   "Title": "Everyday making: identifying future uses for 3D printing in the home",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Rita Shewbridge, Amy Hurst,  Shaun K. Kan",
   "Abstract": "To explore the potential uses of 3D printers and other fabrication devices in the home, we conducted a study in which 10 households (with 28 individuals) kept a faux 3D printer in their homes for four weeks. Participants kept a log of items that they would want to print, and completed a series of design probes. We found that participants' use of the fabrication tools involved three activities: replicating existing objects, modifying and customizing existing objects, and creating new custom objects. Our study also provides insights on the types of objects that individuals wish to create, and how the faux 3D printer was situated in our participants' homes.\n\t[...]",
   "DOI": "https://doi.org/10.1145/2598510.2598544",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Rita_DIS2014.jpg"
 },
 {
   "ID": 136,
   "Year": 2014,
   "Title": "Sensing touch using resistive graphs",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "David Holman, Nicholas Fellion,  Roel Vertegaa",
   "Abstract": "In early design, instrumenting an object with touch sensing capability, especially one with complex surface geometry, can be problematic. In this paper, we show how resistive graph patterns--or resigraphs--can be used to quickly fabricate multi-touch sensors tailored to an object's shape. In very early ideation, resigraphs can be drawn using conductive ink. In later refinements they can be silk-screened or laser cut from off-the-shelf materials. A resigraph uses a commonly available microprocessor (e.g. Arduino), re-quires only three wires, and enables touch input on non-planar and non-developable surfaces. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2598510.2598552",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Holman_DIS2014.jpg"
 },
 {
   "ID": 137,
   "Year": 2014,
   "Title": "Leather as a material for crafting interactive and physical artifacts",
   "Organization": "ACM",
   "Conference": "ACM DIS",
   "Authors": "Vasiliki Tsaknaki, Ylva Fernaeus,  Mischa Schau",
   "Abstract": "In this paper, we present a series of small scale explorations of leather, first as skin close interfaces for physical engagement, and secondly in terms of crafting using hand tools and a laser cutter. We reflect on our experiences along these two strands and discuss future possibilities of leather as a rich material for providing new types of interactive experiences. By discussing emerging topics related to traditional crafting processes and contemporary rapid fabrication with this material, we find a great potential of merging such processes and tools for future interaction design settings. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2598510.2598574",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Vasiliki_DIS2014.jpg"
 },
 {
   "ID": 70,
   "Year": 2016,
   "Title": "ChaCra: an interactive design system for rapid character crafting",
   "Organization": "ACM",
   "Conference": "ACM SCA",
   "Authors": "Vittorio Megaro, Bernhard Thomaszewski, Damien Gauge, Eitan Grinspun, Stelian Coros,  Markus Gros",
   "Abstract": "We propose an interactive design system for rapid crafting of planar mechanical characters. \n\tOur method combines the simplicity of sketch-based modeling with the ease of defining motion \n\tthrough extreme poses. In order to translate digital designs into fabrication-ready \n\tdescriptions, our method automatically \n\tcomputes the mechanical structure that makes the characters move as desired. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2849538",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/chacra_sca2016.png"
 },
 {
   "ID": 111,
   "Year": 2015,
   "Title": "Computational design of walking automata",
   "Organization": "ACM",
   "Conference": "ACM SCA",
   "Authors": "Gaurav Bharaj, Stelian Coros, Bernhard Thomaszewski, James Tompkin, Bernd Bickel,  Hanspeter Pfiste",
   "Abstract": "Creating mechanical automata that can walk in stable and pleasing manners is a challenging task that requires both skill and expertise. We propose to use computational design to offset the technical difficulties of this process. A simple drag-and-drop interface allows casual users to create personalized walking toys from a library of pre-defined template mechanisms. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2786803",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/walkingautomata.jpg"
 },
 {
   "ID": 31,
   "Year": 2017,
   "Title": "Direct and immediate drawing with CNC machines",
   "Organization": "ACM",
   "Conference": "ACM SCF",
   "Authors": "Jingyi Li, Jennifer Jacobs, Michelle Chang,  Björn Hartmann",
   "Abstract": "We investigate how the immediate control of computer numerical control (CNC) machines can narrow the design-fabrication gap and combine manual art practice with digital fabrication. \n\tLINC (Live Interactive Numeric Control) is a sketch-based digital design tool for authoring 2D or 3D artworks in near-real time. \n\tTo use LINC, users draw strokes which are then executed in one of three modes---static, manual, or as soon as possible---by either a large-scale or desktop-sized modified CNC router. \n\tWe evaluate LINC through a study with eight artists. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3083157.3096344",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Li_SCF2017.jpg"
 },
 {
   "ID": 32,
   "Year": 2017,
   "Title": "Bend-a-rule: a fabrication-based workflow for 3D planar contour acquisition",
   "Organization": "ACM",
   "Conference": "ACM SCF",
   "Authors": "Mian Wei, Karan Singh",
   "Abstract": "Bend-a-rule is a physical tool and workflow that enables the robust acquisition of planar contours of 3D shape. Our work exemplifies the design of physical artifacts that subsequently aid in digital design and fabrication. Bend-a-rule is a ruler, fabricated by laser-cutting a periodic pattern on a rigid board. \n\tThe ruler has unidirectional flexibility, and readily bends to conform to the shape of curved planar contours on physical 3D objects. \n\tWe present a novel workflow, by which this curved planar contour can be digitally acquired from a single image of the physical ruler. The acquired contour is then used to design laser-cut accessory shapes that attach to physcial 3D objects along the digitally acquired contour.\n\t[...]",
   "DOI": "https://doi.org/10.1145/3083157.3083164",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Mian_SCF2017.jpg"
 },
 {
   "ID": 71,
   "Year": 2016,
   "Title": "Stenciling: Designing Structurally-Sound Surfaces with Decorative Patterns",
   "Organization": "ACM",
   "Conference": "ACM SGP",
   "Authors": "Christian Schumacher, Bernhard Thomaszewski,  Markus Gros",
   "Abstract": "We present a novel method to design shells with artistic cutouts in a manner that produces \n\ta stable final result. The process of stenciling, removing material with a fixed shape, \n\tis a particularly appealing way to introduce a decorative pattern \n\tinto the design of architectural structures, furniture, or household objects. [...]",
   "DOI": "https://diglib.eg.org/handle/10.1111/cgf12967",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/stenciling_sgp2016.jpg"
 },
 {
   "ID": 112,
   "Year": 2015,
   "Title": "Texture Mapping Real-World Objects with Hydrographics",
   "Organization": "ACM",
   "Conference": "ACM SGP",
   "Authors": "Daniele Panozzo, Olga Diamanti, Sylvain Paris, Marco Tarini, Evgeni Sorkine,  Olga Sorkine-Hornun",
   "Abstract": "In this paper, we develop a method to enable texture mapping of physical objects, \n\tthat is, we allow one to map an arbitrary color image onto a three-dimensional object. \n\tOur approach builds upon hydrographics, \n\ta technique to transfer pigments printed on a sheet of polymer onto curved surfaces. [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12697",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/texmap_sgp2015.gif"
 },
 {
   "ID": 113,
   "Year": 2015,
   "Title": "Reforming Shapes for Material-aware Fabrication",
   "Organization": "ACM",
   "Conference": "ACM SGP",
   "Authors": "Yong-Liang Yang, Jun Wang,  Niloy J. Mitr",
   "Abstract": "In this work, we propose a novel data-driven reforming i.e., reshaping algorithm \n\tthat adapts an input multi-component model for a target fabrication material. \n\tThe algorithm adapts both the part geometry and the inter-part topology of the input \n\tshape to better align with material-aware fabrication requirements.  [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12696",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/reformingshape_sgp2015.jpg"
 },
 {
   "ID": 117,
   "Year": 2015,
   "Title": "Augmented Airbrush for Computer Aided Painting",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Roy Shilkrot, Pattie Maes, Joseph A. Paradiso,  Amit Zora",
   "Abstract": "We present an augmented airbrush that allows novices to experience the art of spray painting. \n\tInspired by the thriving field of smart tools, our handheld device uses 6DOF tracking, augmentation of \n\tthe airbrush trigger, \n\tand a specialized algorithm to restrict the application of paint to a preselected reference image. [...]",
   "DOI": "http://dx.doi.org/10.1145/2699649",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/augmentedbrush_sg2015.jpg"
 },
 {
   "ID": 18,
   "Year": 2017,
   "Title": "String Actuated Curved Folded Surfaces",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Martin Kilian, Aron Monszpart,  Niloy J. Mitra",
   "Abstract": "We introduce string actuated curved folded surfaces that can be shaped by pulling a network of strings, thus, vastly simplifying the process of creating such surfaces and making the folding motion an integral part of the design. \n\tTechnically, we solve the problem of which surface points to string together and how to actuate them by locally expressing a desired folding path in the space of isometric shape deformations in terms of novel string actuation modes. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3015460",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Kilian_S2017.jpg"
 },
 {
   "ID": 19,
   "Year": 2017,
   "Title": "Design and volume optimization of space structures",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Caigui Jiang, Chengcheng Tang, Hans-Peter Seidel,  Peter Wonka",
   "Abstract": "We study the design and optimization of statically sound and materially efficient space structures constructed by connected beams. \n\tWe propose a systematic computational framework for the design of space structures that incorporates static soundness, approximation of reference surfaces, boundary alignment, and geometric regularity. \n\tTo tackle this challenging problem, we first jointly optimize node positions and connectivity through a nonlinear continuous optimization algorithm. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073619",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Jiang_S2017.jpg"
 },
 {
   "ID": 20,
   "Year": 2017,
   "Title": "Interactive design of animated plushies",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "James M. Bern, Kai-Hung Chang,  Stelian Coros",
   "Abstract": "We present a computational approach to creating animated plushies, soft robotic plush toys specifically-designed to reenact user-authored motions. \n\tOur design process is inspired by muscular hydrostat structures, which drive highly versatile motions in many biological systems. \n\tWe begin by instrumenting simulated plush toys with a large number of small, independently-actuated, virtual muscle-fibers. Through an intuitive posing interface, users then begin animating their plushie. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073700",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Bern_S2017.jpg"
 },
 {
   "ID": 21,
   "Year": 2017,
   "Title": "Computational design of telescoping structures",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Christopher Yu, Keenan Crane,  Stelian Coros",
   "Abstract": "We present a novel geometric characterization of telescoping curves, and explore how free-form surfaces can be approximated by networks of such curves. \n\tBased on this principle we develop a system for computational design and fabrication which allows users to explore the space of telescoping structures; inputs to our system include user sketches or arbitrary meshes, which are then converted to a curve skeleton. We prototype applications in animation, fabrication, and robotics, using our system to design a variety of both simulated and fabricated examples. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073673",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yu_S2017.jpg"
 },
 {
   "ID": 22,
   "Year": 2017,
   "Title": "Dynamics-aware numerical coarsening for fabrication design",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Desai Chen, David I. W. Levin, Wojciech Matusik,  Danny M. Kaufman",
   "Abstract": "In this paper we present Dynamics-Aware Coarsening (DAC) and the Boundary Balanced Impact (BBI) model which allow for the accurate simulation of dynamic, elastic objects undergoing both large scale deformation and frictional contact, at rates up to 79 times faster than state-of-the-art methods. \n\tDAC and BBI produce simulations that are accurate and fast enough to be used (for the first time) for the computational design of 3D-printable compliant dynamic mechanisms. \n\tThus we demonstrate the efficacy of DAC and BBI by designing and fabricating mechanisms which flip, throw and jump over and onto obstacles as requested. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073669",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Chen_S2017.jpg"
 },
 {
   "ID": 23,
   "Year": 2017,
   "Title": "A computational design tool for compliant mechanisms",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Vittorio Megaro, Jonas Zehnder, Moritz Bächer, Stelian Coros, Markus Gross,  Bernhard Thomaszewski",
   "Abstract": "We present a computational tool for designing compliant mechanisms. Our method takes as input a conventional, rigidly-articulated mechanism defining the topology of the compliant design. \n\tThis input can be both planar or spatial, and we support a number of common joint types which, whenever possible, are automatically replaced with parameterized flexures. \n\tAs the technical core of our approach, we describe a number of objectives that shape the design space in a meaningful way, including trajectory matching, collision avoidance, lateral stability, resilience to failure, and minimizing motor torque. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073636",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Vittorio_S2017.jpg"
 },
 {
   "ID": 24,
   "Year": 2017,
   "Title": "Computational design and automated fabrication of kirchhoff-plateau surfaces",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jesús Pérez, Miguel A. Otaduy,  Bernhard Thomaszewski",
   "Abstract": "We propose a computational tool for designing Kirchhoff-Plateau Surfaces---planar rod networks embedded in pre-stretched fabric that deploy into complex, three-dimensional shapes. \n\tWhile Kirchhoff-Plateau Surfaces offer an intriguing and expressive design space, navigating this space is made difficult by the highly nonlinear nature of the underlying mechanical problem. \n\tIn order to tackle this challenge, we propose a user-guided but computer-assisted approach that combines an efficient forward simulation model with a dedicated optimization algorithm in order to implement a powerful set of design tools. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073695",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Perez_S2017.jpg"
 },
 {
   "ID": 25,
   "Year": 2017,
   "Title": "Lightweight structure design under force location uncertainty",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Erva Ulu, James Mccann,  Levent Burak Kara",
   "Abstract": "We introduce a lightweight structure optimization approach for problems in which there is uncertainty in the force locations. Such uncertainty may arise due to force contact locations that change during use or are simply unknown a priori. \n\tGiven an input 3D model, regions on its boundary where arbitrary normal forces may make contact, and a total force-magnitude budget, our algorithm generates a minimum weight 3D structure that withstands any force configuration capped by the budget. \n\tOur approach works by repeatedly finding the most critical force configuration and altering the internal structure accordingly. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073626",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Ulu_S2017.jpg"
 },
 {
   "ID": 26,
   "Year": 2017,
   "Title": "Functionality-aware retargeting of mechanisms to 3D shapes",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Ran Zhang, Thomas Auzinger, Duygu Ceylan, Wilmot Li,  Bernd Bickel",
   "Abstract": "We present an interactive design system to create functional mechanical objects. Our computational approach allows novice users to retarget an existing mechanical template to a user-specified input shape. \n\tOur proposed representation for a mechanical template encodes a parameterized mechanism, mechanical constraints that ensure a physically valid configuration, spatial relationships of mechanical parts to the user-provided shape, and functional constraints that specify an intended functionality. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073710",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Ran_S2017.jpg"
 },
 {
   "ID": 27,
   "Year": 2017,
   "Title": "Interactive design space exploration and optimization for CAD models",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Adriana Schulz, Jie Xu, Bo Zhu, Changxi Zheng, Eitan Grinspun,  Wojciech Matusik",
   "Abstract": "In our work, we address these challenges and develop tools that allow interactive exploration and optimization of parametric CAD data. To achieve interactive rates, we use precomputation on an adaptively sampled grid and propose a novel scheme for interpolating in this domain where each sample is a mesh with different combinatorics. \n\tSpecifically, we extract partial correspondences from CAD representations for local mesh morphing and propose a novel interpolation method for adaptive grids that is both continuous/smooth and local (i.e., the influence of each sample is constrained to the local regions where mesh morphing can be computed).  \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073688",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Adriana_S2017.jpg"
 },
 {
   "ID": 28,
   "Year": 2017,
   "Title": "CurveUps: shaping objects from flat plates with tension-actuated curvature",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Ruslan Guseinov, Eder Miguel,  Bernd Bickel",
   "Abstract": "We present a computational approach for designing CurveUps, curvy shells that form from an initially flat state. They consist of small rigid tiles that are tightly held together by two pre-stretched elastic sheets attached to them. \n\tOur method allows the realization of smooth, doubly curved surfaces that can be fabricated as a flat piece. Once released, the restoring forces of the pre-stretched sheets support the object to take shape in 3D. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073709",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Guseinov_S2017.jpg"
 },
 {
   "ID": 29,
   "Year": 2017,
   "Title": "Interactive Design and Stability Analysis of Decorative Joinery for Furniture",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "JiaXian Yao, Danny M. Kaufman, Yotam Gingold, Maneesh Agrawal",
   "Abstract": "To perform this stability analysis, we introduce a novel variational static analysis method that addresses shortcomings of the equilibrium method for our task. \n\tSpecifically, our method correctly detects sliding instabilities and reports the locations and directions of sliding and hinging failures. \n\tWe show that our tool can be used to generate over 100 joints inspired by traditional woodworking and Japanese joinery. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3054740",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yao_SG2017.jpg"
 },
 {
   "ID": 30,
   "Year": 2017,
   "Title": "Orthotropic k-nearest foams for additive manufacturing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jonàs Martínez, Haichuan Song, Jérémie Dumas,  Sylvain Lefebvr",
   "Abstract": "In this work, we propose a novel metamaterial with controllable, freely orientable, orthotropic elastic behavior - orthotropy means that elasticity is controlled independently along three orthogonal axes, which leads to materials that better adapt to uneven, directional load scenarios, and offer a more versatile material design primitive. \n\tThe fine-scale structures are generated procedurally by a stochastic process, and resemble a foam. The absence of global organization and periodicity allows the free gradation of density, orientation, and stretch, leading to the controllable orthotropic behavior. \n\tThe procedural nature of the synthesis process allows it to scale to arbitrarily large volumes at low memory costs. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3072959.3073638",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Jonas_S2017.jpg"
 },
 {
   "ID": 72,
   "Year": 2016,
   "Title": "Printed Perforated Lampshades for Continuous Projective Images",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Haisen Zhao, Lin Lu, Yuan Wei, Dani Lischinski, Andrei Sharf, Daniel Cohen-Or, Baoquan Chen",
   "Abstract": "We present a technique for designing 3D-printed perforated lampshades that project \n\tcontinuous grayscale images onto the surrounding walls. Given the geometry of the \n\tlampshade and a target grayscale image, our method computes a distribution of tiny \n\tholes over the shell, such that the combined footprints of the \n\tlight emanating through the holes form the target image on a nearby diffuse surface. [...]",
   "DOI": "https://doi.org/10.1145/2907049",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Zhao_SG2016.jpg"
 },
 {
   "ID": 73,
   "Year": 2016,
   "Title": "CofiFab: coarse-to-fine fabrication of large 3D objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Peng Song, Bailin Deng, Ziqi Wang, Zhichao Dong, Wei Li, Chi-Wing Fu,  Ligang Li",
   "Abstract": "This paper presents CofiFab, a coarse-to-fine 3D fabrication solution, combining 3D printing and 2D laser cutting for cost-effective fabrication of large objects at lower cost and higher speed. Our key approach is to first build coarse internal base structures within the given 3D object using laser cutting, and then attach thin 3D-printed parts, as an external shell, onto the base to recover the fine surface details. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925876",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cofifab.jpg"
 },
 {
   "ID": 74,
   "Year": 2016,
   "Title": "Connected fermat spirals for layered fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Haisen Zhao, Fanglin Gu, Qi-Xing Huang, Jorge Garcia, Yong Chen, Changhe Tu, Bedrich Benes, Hao Zhang, Daniel Cohen-Or,  Baoquan Che",
   "Abstract": "We develop a new kind of \"space-filling\" curves, connected Fermat spirals, and show their compelling properties as a tool path fill pattern for layered fabrication. Unlike classical space-filling curves such as the Peano or Hilbert curves, which constantly wind and bind to preserve locality, connected Fermat spirals are formed mostly by long, low-curvature paths. This geometric property, along with continuity, influences the quality and efficiency of layered fabrication.",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925958",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fermatspirals.jpg"
 },
 {
   "ID": 75,
   "Year": 2016,
   "Title": "Procedural voronoi foams for additive manufacturing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jonás Martìnez, Jérémie Dumas,  Sylvain Lefebvr",
   "Abstract": "In this paper we propose to study procedural, aperiodic microstructures inspired by Voronoi open-cell foams. The absence of regularity affords for a simple approach to grade the foam geometry --- and thus its mechanical properties --- within a target object and its surface. Rather than requiring a global optimization process, the microstructures are directly generated to exhibit a specified elastic behavior. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925922",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/voronoifoams.jpg"
 },
 {
   "ID": 76,
   "Year": 2016,
   "Title": "Printing arbitrary meshes with a 5DOF wireframe printer",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Rundong Wu, Huaishu Peng, François Guimbretiére,  Steve Marschne",
   "Abstract": "We formalize the collision avoidance problem using a directed graph, and propose an algorithm that finds a locally minimal set of constraints on the order of edges that guarantees there will be no collisions. Then a second algorithm orders the edges so that the printing progresses smoothly. Though meshes do exist that still cannot be printed, our method prints a wide range of models that previous methods cannot, and it provides a fundamental enabling algorithm for future development of wireframe printing. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925966",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/printingarbitrary.jpg"
 },
 {
   "ID": 77,
   "Year": 2016,
   "Title": "Designing structurally-sound ornamental curve networks",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jonas Zehnder, Stelian Coros,  Bernhard Thomaszewsk",
   "Abstract": "We present a computational tool for designing ornamental curve networks---structurally-sound physical surfaces with user-controlled aesthetics. In contrast to approaches that leverage texture synthesis for creating decorative surface patterns, our method relies on user-defined spline curves as central design primitives. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925888",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/curvenetworks.jpg"
 },
 {
   "ID": 78,
   "Year": 2016,
   "Title": "Synthesis of filigrees for digital fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Weikai Chen, Xiaolong Zhang, Shiqing Xin, Yang Xia, Sylvain Lefebvre,  Wenping Wan",
   "Abstract": "Filigrees are thin patterns found in jewelry, ornaments and lace fabrics. They are often formed of repeated base elements manually composed into larger, delicate patterns. Digital fabrication simplifies the process of turning a virtual model of a filigree into a physical object. However, designing a virtual model of a filigree remains a time consuming and challenging task. The difficulty lies in tightly packing together the base elements while covering a target surface.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925911",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/filligrees.jpg"
 },
 {
   "ID": 79,
   "Year": 2016,
   "Title": "Computational design of reconfigurables",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Akash Garg, Alec Jacobson,  Eitan Grinspu",
   "Abstract": "A reconfigurable is an object or collection of objects whose transformation between various states defines its functionality or aesthetic appeal. For example, consider a mechanical assembly composed of interlocking pieces, a transforming folding bicycle, or a space-saving arrangement of apartment furniture.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925900",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/reconfigurables.jpg"
 },
 {
   "ID": 80,
   "Year": 2016,
   "Title": "Acoustic voxels: computational optimization of modular acoustic filters",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Dingzeyu Li, David I. W. Levin, Wojciech Matusik,  Changxi Zhen",
   "Abstract": "A reconfigurable is an object or collection of objects whose transformation between various states defines its functionality or aesthetic appeal. For example, consider a mechanical assembly composed of interlocking pieces, a transforming folding bicycle, or a space-saving arrangement of apartment furniture.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925960",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/acousticvoxels.jpg"
 },
 {
   "ID": 81,
   "Year": 2016,
   "Title": "Computational thermoforming",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Christian Schüller, Daniele Panozzo, Anselm Grundhöfer, Henning Zimmer, Evgeni Sorkine,  Olga Sorkine-Hornun",
   "Abstract": "We propose a method to fabricate textured 3D models using thermoforming. Differently from industrial techniques, which target mass production of a specific shape, we propose a combined hardware and software solution to manufacture customized, unique objects. Our method simulates the forming process and converts the texture of a given digital 3D model into a pre-distorted image that we transfer onto a plastic sheet. During thermoforming, the sheet deforms to create a faithful physical replica of the digital model. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2925914",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/schuller_sg2016.png"
 },
 {
   "ID": 114,
   "Year": 2015,
   "Title": "Hybrid craft: showcase of physical and digital integration of design and craft skills",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Amit Zora",
   "Abstract": "This article introduces the Hybrid Craft exhibition, positioning 15 hybrid \n\tprojects in the context of today's Maker culture. Each project demonstrates a \n\tunique integration of contemporary making practice with traditional craft. \n\tThe presenters in the show represent a wide range of professional backgrounds: independent makers, \n\tstudents and teachers, designers associated with research institutes, and commercial organizations. [...]",
   "DOI": "https://doi.org/10.1145/2810185.2810187",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Amit_sg2015.jpg"
 },
 {
   "ID": 115,
   "Year": 2015,
   "Title": "MultiFab: a machine vision assisted platform for multi-material 3D printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Pitchaya Sitthi-Amorn, Javier E. Ramos, Yuwang Wangy, Joyce Kwan, Justin Lan, Wenshou Wang,  Wojciech Matusi",
   "Abstract": "We have developed a multi-material 3D printing platform that is high-resolution, low-cost, and extensible. \n\tThe key part of our platform is an integrated machine vision system. This \n\tsystem allows for self-calibration of printheads, 3D scanning, and a closed-feedback loop to enable print corrections. [...]",
   "DOI": "https://doi.org/10.1145/2766962",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/multifab_sg2015.jpg"
 },
 {
   "ID": 116,
   "Year": 2015,
   "Title": "Fab Forms: Customizable Objects For Fabrication With Validity And Geometry Caching",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Maria Shugrina, Ariel Shamir, Wojciech Matusi",
   "Abstract": "We define Fab Form as any design representation that lends itself to interactive customization by a novice user, \n\twhile remaining valid and manufacturable.\n\tWe propose a method to achieve these Fab Form requirements for general parametric designs \n\ttagged with a general set of automated validity tests and a small number of parameters exposed to the casual user. \n\tOur solution separates Fab Form evaluation into a precomputation stage and a runtime stage. [...]",
   "DOI": "https://doi.org/10.1145/2766994",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabforms_sg2015.jpg"
 },
 {
   "ID": 118,
   "Year": 2015,
   "Title": "Elastic textures for additive fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni,  Denis Zori",
   "Abstract": "We introduce elastic textures: a set of parametric, tileable, printable, cubic patterns achieving a broad range \n\tof isotropic elastic material properties: the softest pattern is over a thousand times softer than the stiffest, \n\tand the Poisson's ratios range from below zero to nearly 0.5. Using a combinatorial search over topologies followed \n\tby shape optimization, \n\twe explore a wide space of truss-like, symmetric 3D patterns to obtain a small family. [...]",
   "DOI": "https://doi.org/10.1145/2766937",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/elastictexture_sg2015.jpg"
 },
 {
   "ID": 119,
   "Year": 2015,
   "Title": "OmniAD: data-driven omni-directional aerodynamics",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Tobias Martin, Nobuyuki Umetani,  Bernd Bicke",
   "Abstract": "This paper introduces \"OmniAD,\" a novel data-driven pipeline to model and acquire the aerodynamics of \n\tthree-dimensional rigid objects. Traditionally, aerodynamics are examined through elaborate wind tunnel \n\texperiments or expensive fluid dynamics computations, and are only measured for a small number of discrete wind \n\tdirections. [...]",
   "DOI": "https://doi.org/10.1145/2766919",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/omniad_sg2015.jpg"
 },
 {
   "ID": 120,
   "Year": 2015,
   "Title": "LinkEdit: interactive linkage editing using symbolic kinematics",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Moritz Bächer, Stelian Coros,  Bernhard Thomaszewsk",
   "Abstract": "Articulated deformable characters are widespread in computer animation. Unfortunately, we lack methods for their automatic fabrication using modern additive manufacturing (AM) technologies. We propose a method that takes a skinned mesh as input, then estimates a fabricatable single-material model that approximates the 3D kinematics of the corresponding virtual articulated character in a piecewise linear manner.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2766985",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/linkedit.jpg"
 },
 {
   "ID": 121,
   "Year": 2015,
   "Title": "Computational design of metallophone contact sounds",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Gaurav Bharaj, David I. W. Levin, James Tompkin, Yun Fei, Hanspeter Pfister, Wojciech Matusik,  Changxi Zhen",
   "Abstract": "Metallophones such as glockenspiels produce sounds in response to contact. Building these instruments is a complicated process, limiting their shapes to well-understood designs such as bars. We automatically optimize the shape of arbitrary 2D and 3D objects through deformation and perforation to produce sounds when struck which match user-supplied frequency and amplitude spectra.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2766985",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/contactsounds.jpg"
 },
 {
   "ID": 122,
   "Year": 2015,
   "Title": "Pushing the Limits of 3D Color Printing: Error Diffusion with Translucent Materials",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Alan Brunton, Can Ates Arikan,  Philipp Urba",
   "Abstract": "In this article, we propose an error diffusion halftoning approach to achieve full color with multi-jet printers, which operates on multiple isosurfaces or layers within the object. We propose a novel traversal algorithm for voxel surfaces, which allows the transfer of existing error diffusion algorithms from 2D printing. The resulting prints faithfully reproduce colors, color gradients and fine-scale details.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2832905",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/halftoning.jpg"
 },
 {
   "ID": 123,
   "Year": 2015,
   "Title": "Microstructures to control elasticity in 3D printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio,  Markus Gros",
   "Abstract": "We propose a method for fabricating deformable objects with spatially varying elasticity using 3D printing. Using a single, relatively stiff printer material, our method designs an assembly of small-scale microstructures that have the effect of a softer material at the object scale, with properties depending on the microstructure used in each part of the object. We build on work in the area of metamaterials, using numerical optimization to design tiled microstructures with desired properties, but with the key difference that our method designs families of related structures that can be interpolated to smoothly vary the material properties over a wide range. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2766926",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/schumacher_sg2015.jpg"
 },
 {
   "ID": 124,
   "Year": 2015,
   "Title": "Dapper: decompose-and-pack for 3D printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Xuelin Chen, Hao Zhang, Jinjie Lin, Ruizhen Hu, Lin Lu, Qixing Huang, Bedrich Benes, Daniel Cohen-Or,  Baoquan Che",
   "Abstract": "We present Dapper, a global optimization algorithm for the DAP problem which can be applied to both powder- and FDM-based 3D printing. The solution search is top-down and iterative. Starting with a coarse decomposition of the input shape into few initial parts, we progressively pack a pile in the printing volume, by iteratively docking parts, possibly while introducing cuts, onto the pile. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2818087",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/dapper_sg2015.jpg"
 },
 {
   "ID": 144,
   "Year": 2014,
   "Title": "Pteromys: interactive design and optimization of free-formed free-flight model airplanes",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Nobuyuki Umetani, Yuki Koyama, Ryan Schmidt,  Takeo Igarash",
   "Abstract": "This paper introduces novel interactive techniques for designing original hand-launched free-flight glider airplanes which can actually fly. \n\tWe present a compact and efficient representation of glider aerodynamics that can be fit to real-world conditions using a data-driven method. [...]",
   "DOI": "http://dx.doi.org/10.1145/2601097.2601129",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/pteromys_sg2014.jpg"
 },
 {
   "ID": 145,
   "Year": 2014,
   "Title": "Computational design of linkage-based characters",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Bernhard Thomaszewski, Stelian Coros, Damien Gauge, Vittorio Megaro, Eitan Grinspun,  Markus Gros",
   "Abstract": "We present a design system for linkage-based characters, combining form and function in an aesthetically-pleasing \n\tmanner. Linkage-based character design exhibits a mix of discrete and continuous problems, \n\tmaking for a highly unintuitive design space that is difficult to navigate without assistance. [...]",
   "DOI": "http://dx.doi.org/10.1145/2601097.2601143",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cdlc_sg2014.jpg"
 },
 {
   "ID": 146,
   "Year": 2014,
   "Title": "High-contrast computational caustic design",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Yuliy Schwartzburg, Romain Testuz, Andrea Tagliasacchi,  Mark Paul",
   "Abstract": "We present a new algorithm for computational caustic design. \n\tOur algorithm solves for the shape of a transparent object such that the refracted light paints a desired caustic image on a receiver screen. We introduce an optimal \n\ttransport formulation to establish a correspondence between the input geometry and the unknown target shape. [...]",
   "DOI": "http://dx.doi.org/10.1145/2601097.2601200",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/hcccd_sg2014.jpg"
 },
 {
   "ID": 147,
   "Year": 2014,
   "Title": "Computational Light Routing: 3D Printed Optical Fibers for Sensing and Display",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Thiago Pereira, Szymon Rusinkiewicz,  Wojciech Matusi",
   "Abstract": "We introduce automatic fiber design algorithms together with new manufacturing techniques \n\tto route light between two arbitrary surfaces. Our implicit algorithm optimizes light transmission \n\tby minimizing fiber curvature and maximizing \n\tfiber separation while respecting constraints such as fiber arrival angle. [...]",
   "DOI": "http://doi.acm.org/10.1145/2602140",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/clr_sg2014.jpg"
 },
 {
   "ID": 148,
   "Year": 2014,
   "Title": "Spin-It: Optimizing Moment of Inertia for Spinnable Objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Moritz Bächer, Emily Whiting, Bernd Bickel,  Olga Sorkine-Hornun",
   "Abstract": "Spinning tops and yo-yos have long fascinated cultures around the world with their unexpected, graceful motions that seemingly elude gravity. We present an algorithm to generate designs for spinning objects by optimizing rotational dynamics properties. As input, the user provides a solid 3D model and a desired axis of rotation. Our approach then modifies the mass distribution such that the principal directions of the moment of inertia align with the target rotation frame.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2601157",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/spinit.jpg"
 },
 {
   "ID": 149,
   "Year": 2014,
   "Title": "Branching support structures for 3D printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Ryan Schmidt, Nobuyuki Umetan",
   "Abstract": "Most 3D printing processes can be modeled by an incremental stacking of thin, flexible layers. In this case, it is apparent that for complex shapes, some stacks will be \"floating\" in mid-air unless they are supported from below by additional material. Similarly if a slice is much larger than the one below it, it will droop unless supported. These areas are called overhangs [Evans 2012], and most 3D printing software provides automated generation of some kind of support structure. However, the support is waste, of both time and material, and this waste should be minimized. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2656293",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/schmidt_sg2014.jpg"
 },
 {
   "ID": 150,
   "Year": 2014,
   "Title": "Design and fabrication by example",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Adriana Schulz, Ariel Shamir, David I. W. Levin, Pitchaya Sitthi-amorn,  Wojciech Matusi",
   "Abstract": "We propose a data-driven method for designing 3D models that can be fabricated. First, our approach converts a collection of expert-created designs to a dataset of parameterized design templates that includes all information necessary for fabrication. The templates are then used in an interactive design system to create new fabri-cable models in a design-by-example manner. A simple interface allows novice users to choose template parts from the database, change their parameters, and combine them to create new models. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2601127",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabbyexample.jpg"
 },
 {
   "ID": 151,
   "Year": 2014,
   "Title": "Build-to-last: strength to weight 3D printed objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Lin Lu, Andrei Sharf, Haisen Zhao, Yuan Wei, Qingnan Fan, Xuelin Chen, Yann Savoye, Changhe Tu, Daniel Cohen-Or,  Baoquan Che",
   "Abstract": "We introduce a hollowing optimization algorithm based on the concept of honeycomb-cells structure. Honeycombs structures are known to be of minimal material cost while providing strength in tension. We utilize the Voronoi diagram to compute irregular honeycomb-like volume tessellations which define the inner structure. We formulate our problem as a strength--to--weight optimization and cast it as mutually finding an optimal interior tessellation and its maximal hollowing subject to relieve the interior stress. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2601168",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Lin_SG2014.jpg"
 },
 {
   "ID": 152,
   "Year": 2014,
   "Title": "Bridging the gap: automated steady scaffoldings for 3D printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jérémie Dumas, Jean Hergel,  Sylvain Lefebvr",
   "Abstract": "We propose to exploit the ability of FFF printers to print bridges across gaps. Since bridges are always supported by pillars at their extremities, they are both stronger and more stable than hierarchical tree structures. The result is an automated support generation technique using little material while ensuring fine surface quality and stability during the printing process. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2601153",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/btg_sg2014.jpg"
 },
 {
   "ID": 169,
   "Year": 2013,
   "Title": "Hybrid basketry: interweaving digital practice within contemporary craft",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Amit Zora",
   "Abstract": "In this paper, the author argues for merging these two distinct traditions. \n\tTo that end, he developed hybrid basketry, a medium where 3D-printed structures are \n\tshaped to allow the growth and development of hand-woven patterns. While the 3D-printed \n\tplastic elements contribute the aesthetics of the digital curvatures and manifolds, \n\tthe hand-woven reed, jute, and canvas fibers infuse the baskets with a unique organic appeal.  [...]",
   "DOI": "https://doi.org/10.1145/2503649.2503651",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Amit_SG2014.jpg"
 },
 {
   "ID": 170,
   "Year": 2013,
   "Title": "OpenFab: a programmable pipeline for multi-material fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Kiril Vidimce, Szu-Po Wang, Jonathan Ragan-Kelley,  Wojciech Matusi",
   "Abstract": "We present OpenFab, a programmable pipeline for synthesis of multi-material 3D printed objects that is \n\tinspired by RenderMan and modern GPU pipelines. The pipeline supports procedural evaluation of \n\tgeometric detail and material composition, using shader-like fablets, allowing models to be specified \n\teasily and efficiently. [...]",
   "DOI": "http://dx.doi.org/10.1145/2461912.2461993",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/openfab_sg2013.jpg"
 },
 {
   "ID": 171,
   "Year": 2013,
   "Title": "Computational Design of Mechanical Characters",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik,  Bernd Bicke",
   "Abstract": "We present an interactive design system that allows non-expert users to create animated mechanical characters. Given an articulated character as input, the user iteratively creates an animation by sketching motion curves indicating how different parts of the character should move. For each motion curve, our framework creates an optimized mechanism that reproduces it as closely as possible. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2461953",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/mechanicalcharacter.jpg"
 },
 {
   "ID": 172,
   "Year": 2013,
   "Title": "Spec2Fab: a reducer-tuner model for translating specifications to 3D prints",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Desai Chen, David I. W. Levin, Piotr Didyk, Pitchaya Sitthi-Amorn,  Wojciech Matusi",
   "Abstract": "In this paper, we propose an abstraction mechanism that simplifies the design, development, implementation, and reuse of these algorithms. Our solution relies on two new data structures: a reducer tree that efficiently parameterizes the space of material assignments and a tuner network that describes the optimization process used to compute material arrangement. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2461994",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/spec2fab.jpg"
 },
 {
   "ID": 173,
   "Year": 2013,
   "Title": "Computational design of actuated deformable characters",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Mélina Skouras, Bernhard Thomaszewski, Stelian Coros, Bernd Bickel,  Markus Gros",
   "Abstract": "We present a method for fabrication-oriented design of actuated deformable characters that allows a user to automatically create physical replicas of digitally designed characters using rapid manufacturing technologies. Given a deformable character and a set of target poses as input, our method computes a small set of actuators along with their locations on the surface and optimizes the internal material distribution such that the resulting character exhibits the desired deformation behavior.  [...]",
   "DOI": "http://dx.doi.org/10.1145/2461912.2461979",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/deformcharacters.jpg"
 },
 {
   "ID": 174,
   "Year": 2013,
   "Title": "Make it stand: balancing shapes for 3D fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Romain Prevost, Emily Whiting, Sylvain Lefebvre,  Olga Sorkine-Hornun",
   "Abstract": "We propose to assist users in producing novel, properly balanced designs by interactively deforming an existing model. We formulate balance optimization as an energy minimization, improving stability by modifying the volume of the object, while preserving its surface details. This takes place during interactive editing: the user cooperates with our optimizer towards the end result. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2461957",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/makeitstand.jpg"
 },
 {
   "ID": 175,
   "Year": 2013,
   "Title": "Worst-case structural analysis",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Qingnan Zhou, Julian Panetta,  Denis Zori",
   "Abstract": "We present a method that would identify structural problems in objects designed for 3D printing based on geometry and material properties only, without specific assumptions on loads and manual load setup. We solve a constrained optimization problem to determine the \"worst\" load distribution for a shape that will cause high local stress or large deformations. While in its general form this optimization has a prohibitively high computational cost, we demonstrate that an approximate method makes it possible to solve the problem rapidly for a broad range of printed models. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2461967",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/worstcasestructure.jpg"
 },
 {
   "ID": 176,
   "Year": 2013,
   "Title": "Enchanted scissors: a scissor interface for support in cutting and interactive fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Mayu M. Yamashita, Junichi Yamaoka,  Yasuaki Kakeh",
   "Abstract": "We present an approach to support basic and complex cutting processes through an interactive fabrication experience [Willis et al. 2011]. Our system, enchanted scissors, is a digitally controlled pair of scissors (Figure 1). It restricts areas that can be cut while requiring the user's exertion of force and decision to execute each cut. Therefore, unlike a completely digitalized cutting device, the user can freely apply improvisations within the permitted areas in real-time.[...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2503422",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/enhancescissors.jpg"
 },
 {
   "ID": 177,
   "Year": 2013,
   "Title": "InfraStructs: fabricating information inside physical objects for imaging in the terahertz region",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Karl D. D. Willis, Andrew D. Wilso",
   "Abstract": "We introduce InfraStructs, material-based tags that embed information inside digitally fabricated objects for imaging in the Terahertz region. Terahertz imaging can safely penetrate many common materials, opening up new possibilities for encoding hidden information as part of the fabrication process. We outline the design, fabrication, imaging, and data processing steps to fabricate information inside physical objects. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2461936",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/infrastructs.jpg"
 },
 {
   "ID": 191,
   "Year": 2012,
   "Title": "Stress relief: improving structural strength of 3D printable objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Ondrej Stava, Juraj Vanek, Bedrich Benes, Nathan Carr,  Radomìr Mec",
   "Abstract": "We developed a system that addresses the printability issues by providing automatic detection and correction of the problematic cases.\n\tOur system detects potential problematic cases by considering gravity and gripping forces by evaluating most possible places on the object where it can be held. [...]",
   "DOI": "http://dx.doi.org/10.1145/2185520.2185544",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/stressrelief_sg2012.jpg"
 },
 {
   "ID": 192,
   "Year": 2012,
   "Title": "Fabricating articulated characters from skinned meshes",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Moritz Bächer, Bernd Bickel, Doug L. James,  Hanspeter Pfiste",
   "Abstract": "Articulated deformable characters are widespread in computer animation. Unfortunately, we lack methods for their automatic fabrication using modern additive manufacturing (AM) technologies. We propose a method that takes a skinned mesh as input, then estimates a fabricatable single-material model that approximates the 3D kinematics of the corresponding virtual articulated character in a piecewise linear manner.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2185543",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/articulatedcharacters.jpg"
 },
 {
   "ID": 193,
   "Year": 2012,
   "Title": "Physical Face Cloning",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Bernd Bickel, Peter Kaufmann, Mélina Skouras, Bernhard Thomaszewski, Derek Bradley, Thabo Beeler, Phil Jackson, Steve Marschner, Wojciech Matusik,  Markus Gros",
   "Abstract": "We propose a complete process for designing, simulating, and fabricating synthetic skin for an animatronics character that mimics the face of a given subject and its expressions. The process starts with measuring the elastic properties of a material used to manufacture synthetic soft tissue. Given these measurements we use physics-based simulation to predict the behavior of a face when it is driven by the underlying robotic actuation.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2185614",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/facecloning.jpg"
 },
 {
   "ID": 194,
   "Year": 2012,
   "Title": "Position-correcting tools for 2D digital fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Alec Rivers, Ilan E. Moyer,  Frédo Du",
   "Abstract": "We propose a new approach to precise positioning of a tool that combines manual and automatic positioning: in our approach, the user coarsely positions a frame containing the tool in an approximation of the desired path, while the device tracks the frame's location and adjusts the position of the tool within the frame to correct the user's positioning error in real time. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2185584",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/positioncorrecting.jpg"
 },
 {
   "ID": 198,
   "Year": 2011,
   "Title": "Sensitive Couture for Interactive Garment Editing and Modeling",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Nobuyuki Umetani, Danny M. Kaufman, Takeo Igarashi, Eitan Grinspun",
   "Abstract": "We present a novel interactive tool for garment design that enables, for the first time, \n\tinteractive bidirectional editing between 2D patterns and 3D high-fidelity simulated draped forms. \n\tThis provides a continuous, interactive, and natural design modality in which 2D and 3D representations are \n\tsimultaneously visible and seamlessly maintain correspondence. [...]",
   "DOI": "https://doi.org/10.1145/2010324.1964985",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Nobuyuki_SG2011.jpg"
 },
 {
   "ID": 199,
   "Year": 2011,
   "Title": "Converting 3D furniture models to fabricatable parts and connectors",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Manfred Lau, Akira Ohgawara, Jun Mitani,  Takeo Igarash",
   "Abstract": "Although there is an abundance of 3D models available, most of them exist only in virtual simulation and are not immediately usable as physical objects in the real world. We solve the problem of taking as input a 3D model of a man-made object, and automatically generating the parts and connectors needed to build the corresponding physical object. We focus on furniture models, and we define formal grammars for IKEA cabinets and tables. We perform lexical analysis to identify the primitive parts of the 3D model. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1964980",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/connectors.png"
 },
 {
   "ID": 204,
   "Year": 2010,
   "Title": "Design and Fabrication of Materials with Desired Deformation Behavior",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Bernd Bickel, Moritz Bächer, Miguel A. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross,  Wojciech Matusi",
   "Abstract": "This paper introduces a data-driven process for designing and fabricating materials with desired deformation behavior. Our process starts with measuring deformation properties of base materials. For each base material we acquire a set of example deformations, and we represent the material as a non-linear stress-strain relationship in a finite-element model.   [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1778800",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/deformationbehavior.jpg"
 },
 {
   "ID": 205,
   "Year": 2010,
   "Title": "Fabricating spatially-varying subsurface scattering",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Yue Dong, Jiaping Wang, Fabio Pellacini, Xin Tong,  Baining Gu",
   "Abstract": "In this paper, we present a complete solution for fabricating a material volume with a desired surface BSSRDF. We stack layers from a fixed set of manufacturing materials whose thickness is varied spatially to reproduce the heterogeneity of the input BSSRDF.   [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1778799",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/surfacescattering.jpg"
 },
 {
   "ID": 209,
   "Year": 2009,
   "Title": "Fabricating microgeometry for custom surface reflectance",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Tim Weyrich, Pieter Peers, Wojciech Matusik,  Szymon Rusinkiewic",
   "Abstract": "We propose a system for manufacturing physical surfaces that, in aggregate, exhibit a desired surface appearance. \n\tOur system begins with a user specification of a BRDF, or simply a highlight shape, \n\tand infers the required distribution of surface slopes. \n\tWe demonstrate a variety of surfaces, ranging from reproductions of measured BRDFs to materials with unconventional highlights. \n\t[...]",
   "DOI": "http://dx.doi.org/10.1145/1531326.1531338",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabricmicro_sg2009.jpg"
 },
 {
   "ID": 212,
   "Year": 2007,
   "Title": "Plushie: an interactive design system for plush toys",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Yuki Mori, Takeo Igarash",
   "Abstract": "We introduce Plushie, an interactive system that allows nonprofessional users to design their own original plush toys. To design a plush toy, one needs to construct an appropriate two-dimensional (2D) pattern. \n\tHowever, it is difficult for non-professional users to appropriately design a 2D pattern. [...]",
   "DOI": "http://dx.doi.org/10.1145/1275808.1276433",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/plushie_sg2007.jpg"
 },
 {
   "ID": 213,
   "Year": 2006,
   "Title": "A compact factored representation of heterogeneous subsurface scattering",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Pieter Peers, Karl vom Berge, Wojciech Matusik, Ravi Ramamoorthi, Jason Lawrence, Szymon Rusinkiewicz,  Philip Dutr",
   "Abstract": "In this paper, we address the problem of acquiring and compactly representing the spatial component of heterogeneous subsurface scattering functions. We propose a material model based on matrix factorization that can be mapped onto arbitrary geometry, and, due to its compact form, can be incorporated into most visualization systems with little overhead. We present results of several real-world datasets that are acquired using a projector and a digital camera.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1141950",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/peers_sg2006.jpg"
 },
 {
   "ID": 214,
   "Year": 2004,
   "Title": "Making papercraft toys from meshes using strip-based approximate unfolding",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Jun Mitani, Hiromasa Suzuk",
   "Abstract": "We propose a new method for producing unfolded papercraft patterns of rounded toy animal figures from triangulated meshes by means of strip-based approximation. Although in principle a triangulated model can be unfolded simply by retaining as much as possible of its connectivity while checking for intersecting triangles in the unfolded plane, creating a pattern with tens of thousands of triangles is unrealistic. Our approach is to approximate the mesh model by a set of continuous triangle strips with no internal vertices. Initially, we subdivide our mesh into parts corresponding to the features of the model.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1015711",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/mitani_sg2004.jpg"
 },
 {
   "ID": 1,
   "Year": 2017,
   "Title": "Computational Design of Wind-up Toys",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Peng Song, Xiaofei Wang, Xiao Tang, Chi-Wing Fu, Hongfei Xu, Ligang Liu, Niloy Mitr",
   "Abstract": "This paper presents a computational system to aid the design of wind-up toys, focusing on constructing a compact internal wind-up mechanism to realize user-requested part motions. The key contributions include an analytical modeling of a wide variety of elemental mechanisms found in common wind-up toys, including their geometry and kinematics, conceptual design of wind-up mechanisms by computing motion transfer trees to realize the requested part motions, automatic construction [...]",
   "DOI": "https://dl.acm.org/citation.cfm?doid=3130800.3130808",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/windup_toys.jpg"
 },
 {
   "ID": 2,
   "Year": 2017,
   "Title": "Computational Design and Fabrication of Soft Pneumatic Objects with Desired Deformations",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Li-Ke Ma, Yizhong Zhang, Yang Liu, Kun Zhou, Xin Ton",
   "Abstract": "This paper presents an end-to-end solution for design and fabrication of soft pneumatic objects with desired deformations. Given a 3D object with its rest and deformed target shapes, the method automatically optimizes the chamber\n\tstructure and material distribution inside the object volume so that the fabricated object can deform to [...]",
   "DOI": "https://dl.acm.org/citation.cfm?doid=3130800.3130850",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/CDF_softPneumatic.jpg"
 },
 {
   "ID": 3,
   "Year": 2017,
   "Title": "MetaSilicone: Design and Fabrication of Composite Silicone with Desired Mechanical Properties",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Jonas Zehnder, Espen Knoop, Moritz Bächer, Bernhard Thomaszewsk",
   "Abstract": "This paper presents a method for designing and fabricating MetaSilicones---composite silicone rubbers that exhibit desired macroscopic mechanical properties. The underlying principle of the approach is to inject spherical inclusions of a liquid dopant material into a silicone matrix material. By varying the number, size, and locations [...]",
   "DOI": "https://dl.acm.org/citation.cfm?doid=3130800.3130881",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/MetaSilicone.jpg"
 },
 {
   "ID": 4,
   "Year": 2017,
   "Title": "Scattering-aware Texture Reproduction for 3D Printing",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Oskar Elek, \tDenis Sumin, \tRan Zhang, \tTim Weyrich, \tKarol Myszkowski, \tBernd Bickel, \tAlexander Wilkie, \tJaroslav Křiváne",
   "Abstract": "This paper uses heterogeneous scattering to obtain the impression of a crisp albedo texture on top of the 3D print, by optimizing for a fully volumetric material distribution that preserves the target appearance. The method employs an efficient numerical optimizer on top of a general Monte-Carlo simulation of heterogeneous scattering, supported by a practical calibration procedure to obtain scattering parameters from a given set of printer materials.[...]",
   "DOI": "https://dl.acm.org/citation.cfm?doid=3130800.3130890",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Scattering3DPrint.jpg"
 },
 {
   "ID": 5,
   "Year": 2017,
   "Title": "3D Printing Wireless Connected Objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Vikram Iyer, \tJustin Chan, \tShyamnath Gollakot",
   "Abstract": "This paper presents toolkit for wireless connectivity that can be integrated with 3D digital models and fabricated using commodity desktop 3D printers and commercially available plastic filament materials. The work introduces the first computational designs that 1) send data to commercial RF receivers including Wi-Fi, enabling 3D printed wireless sensors and input widgets, and [...]",
   "DOI": "https://doi.org/10.1145/3130800.3130822",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/3DPrintWifi.jpg"
 },
 {
   "ID": 6,
   "Year": 2017,
   "Title": "Reconfigurable Interlocking Furniture",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Peng Song, \tChi-Wing Fu, \tYueming Jin, \tHongfei Xu, \tLigang Liu, \tPheng-Ann Heng, \tDaniel Cohen-O",
   "Abstract": "This paper presents computational methods as tools to assist the design and construction of reconfigurable assemblies, typically for furniture. The authors present the compatible decomposition as a weakly-constrained dissection problem, and derive its solution based on a dynamic bipartite graph to construct parts across multiple forms[...]",
   "DOI": "https://doi.org/10.1145/3130800.3130803",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/ReconfigInterlocking.jpg"
 },
 {
   "ID": 7,
   "Year": 2017,
   "Title": "Fabricable Tile Decors",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Weikai Chen, \tYuexin Ma, \tSylvain Lefebvre, \tShiqing Xin, \tJonàs Martínez, \tWenping Wan",
   "Abstract": "This paper presents an approach to model and fabricate surface-like objects composed of connected tiles, which can be used as objects in daily life, such as ornaments, covers, shades or handbags.[...]",
   "DOI": "https://doi.org/10.1145/3130800.3130817",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabtiledecor.jpg"
 },
 {
   "ID": 59,
   "Year": 2016,
   "Title": "Computational multicopter design",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Tao Du, Adriana Schulz, Bo Zhu, Bernd Bickel,  Wojciech Matusi",
   "Abstract": "We present an interactive system for computational design, optimization, and fabrication of multicopters. Our computational approach allows non-experts to design, explore, and evaluate a wide range of different multicopters. We provide users with an intuitive interface for assembling a multicopter from a collection of components (e.g., propellers, motors, and carbon fiber rods). [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2982427",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/comdrone_sigasia2016.jpg"
 },
 {
   "ID": 60,
   "Year": 2016,
   "Title": "Stochastic structural analysis for context-aware design and fabrication",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Timothy Langlois, Ariel Shamir, Daniel Dror, Wojciech Matusik,  David I. W. Levi",
   "Abstract": "In this paper we propose failure probabilities as a semantically and mechanically meaningful measure of object fragility. We present a stochastic finite element method which exploits fast rigid body simulation and reduced-space approaches to compute spatially varying failure probabilities. We use an explicit rigid body simulation to emulate the real-world loading conditions an object might experience, including persistent and transient frictional contact, while allowing us to combine several such scenarios together. [...]",
   "DOI": "dl.acm.org/citation.cfm?id=2982436",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/structureanay_sigasia2016.png"
 },
 {
   "ID": 61,
   "Year": 2016,
   "Title": "Fabrication of freeform objects by principal strips",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Masahito Takezawa, Takuma Imai, Kentaro Shida,  Takashi Maekaw",
   "Abstract": "Our novel method uses orthogonal principal strips to fabricate objects whose boundary consists of freeform surfaces. This approach not only lends an artistic touch to the appearance of objects, but also provides directions for reinforcement, as the surface is mostly bent along the lines of curvature. Moreover, it is unnecessary to adjust the bending of these orthogonal strips during the construction process, which automatically reforms the design shape as if it is memorized, provided the strips possess bending rigidity. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2982406",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabfreeform_sigsa2016.png"
 },
 {
   "ID": 62,
   "Year": 2016,
   "Title": "FrameFab: robotic fabrication of frame shapes",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Yijiang Huang, Juyong Zhang, Xin Hu, Guoxian Song, Zhongyuan Liu, Lei Yu,  Ligang Li",
   "Abstract": "In this paper, we present a novel algorithm to generate a feasible fabrication sequence for general frame shapes. To solve this non-trivial combinatorial problem, we develop a divide-and-conquer strategy that first decomposes the input frame shape into stable layers via a constrained sparse optimization model. Then we search a feasible sequence for each layer via a local optimization method together with a backtracking strategy. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?doid=2980179.2982401",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/FrameFab_sigasia2016.jpg"
 },
 {
   "ID": 63,
   "Year": 2016,
   "Title": "FlexMolds: automatic design of flexible shells for molding",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Luigi Malomo, Nico Pietroni, Bernd Bickel,  Paolo Cignon",
   "Abstract": "We present FlexMolds, a novel computational approach to automatically design flexible, reusable molds that, once 3D printed, allow us to physically fabricate, by means of liquid casting, multiple copies of complex shapes with rich surface details and complex topology. The approach to design such flexible molds is based on a greedy bottom-up search of possible cuts over an object, evaluating for each possible cut the feasibility of the resulting mold. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2982397",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/flexmolds_sigasia2016.jpg"
 },
 {
   "ID": 100,
   "Year": 2015,
   "Title": "AutoConnect: Computational Design of 3D-Printable Connectors",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, Wojciech Matusik",
   "Abstract": "We present AutoConnect, an automatic method that creates customized, 3D-printable connectors attaching two physical objects together. \n\tUsers simply position and orient virtual models of the two objects that they want to connect and indicate some auxiliary information such as weight and dimensions. \n\tThen, AutoConnect creates several alternative designs that users can choose from for 3D printing. The design of the connector is created by combining two holders, one for each object. [...]",
   "DOI": "https://doi.org/10.1145/2816795.2818060",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Koyama_SGA2015.jpg"
 },
 {
   "ID": 101,
   "Year": 2015,
   "Title": "Interactive design of 3D-printable robotic creatures",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Vittorio Megaro, Bernhard Thomaszewski, Maurizio Nitti, Otmar Hilliges, Markus Gross,  Stelian Coro",
   "Abstract": "We present an interactive design system that allows casual users to quickly create 3D-printable robotic creatures. Our approach automates the tedious parts of the design process while providing ample room for customization of morphology, proportions, gait and motion style. The technical core of our framework is an efficient optimization-based solution that generates stable motions for legged robots of arbitrary designs. [...]",
   "DOI": "http://dx.doi.org/10.1145/2816795.2818137",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/megaro_sga2015.png"
 },
 {
   "ID": 102,
   "Year": 2015,
   "Title": "Perceptual models of preference in 3D printing direction",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Xiaoting Zhang, Xinyi Le, Athina Panotopoulou, Emily Whiting,  Charlie C. L. Wan",
   "Abstract": "This paper introduces a perceptual model for determining 3D printing orientations. Additive manufacturing methods involving low-cost 3D printers often require robust branching support structures to prevent material collapse at overhangs. Although the designed shape can successfully be made by adding supports, residual material remains at the contact points after the supports have been removed, resulting in unsightly surface artifacts. Moreover, fine surface details on the fabricated model can easily be damaged while removing supports. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2818121",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/zhang_sga2015.jpg"
 },
 {
   "ID": 139,
   "Year": 2014,
   "Title": "Field-Aligned Mesh Joinery",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Paolo Cignoni, Nico Pietroni, Luigi Malomo, Roberto Scopign",
   "Abstract": "We represent an input geometry as a set of planar pieces arranged to compose a rigid structure, by exploiting an efficient slit mechanism. Since slices are planar, to fabricate them a standard 2D cutting system is enough. We automatically arrange slices according to a smooth cross field defined over the surface. Cross fields allow representing global features that char- acterize the appearance of the shape. Slice placement conforms to specific manufacturing constraints. [...]",
   "DOI": "https://doi.org/10.1145/2537852",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/famj_sa2014.jpg"
 },
 {
   "ID": 140,
   "Year": 2014,
   "Title": "Creating works-like prototypes of mechanical objects",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Bongjin Koo, Wilmot Li, JiaXian Yao, Maneesh Agrawala,  Niloy J. Mitr",
   "Abstract": "Designers often create physical works-like prototypes early in the product development cycle to explore possible mechanical architectures for a design. Yet, creating functional prototypes requires time and expertise, which discourages rapid design iterations. Designers must carefully specify part and joint parameters to ensure that parts move and fit and together in the intended manner. We present an interactive system that streamlines the process by allowing users to annotate rough 3D models with high-level functional relationships (e.g., part A fits inside part B). [...]",
   "DOI": "http://dx.doi.org/10.1145/2661229.2661289",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/bongjin_sga2014.jpg"
 },
 {
   "ID": 162,
   "Year": 2013,
   "Title": "Cost-effective printing of 3D objects with skin-frame structures",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Weiming Wang, Tuanfeng Y. Wang, Zhouwang Yang, Ligang Liu, Xin Tong, Weihua Tong, Jiansong Deng, Falai Chen,  Xiuping Li",
   "Abstract": "In this paper, we present an automatic solution to design a skin-frame structure \n\tfor the purpose of reducing the material cost in printing a given 3D object. \n\tThe frame structure is designed by an optimization scheme which significantly reduces material \n\tvolume and is guaranteed to be physically stable, \n\tgeometrically approximate, and printable. [...]",
   "DOI": "http://dx.doi.org/10.1145/2508363.2508382",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cep3d_sa2013.jpg"
 },
 {
   "ID": 163,
   "Year": 2013,
   "Title": "Cross-sectional structural analysis for 3D printing optimization",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Nobuyuki Umetani, Ryan Schmid",
   "Abstract": "We propose a novel cross-sectional structural analysis technique that efficiently detects critical stress \n\tinside a 3D object. We slice the object into cross-sections and compute stress based on bending momentum \n\tequilibrium. Unlike traditional approaches based on finite element methods, \n\tour method doesn’t require a volumetric mesh or solution of linear systems, enabling interactive analysis speed. [...]",
   "DOI": "http://dx.doi.org/10.1145/2542355.2542361",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/crosssection_sa2013.jpg"
 },
 {
   "ID": 164,
   "Year": 2013,
   "Title": "Designing and fabricating mechanical automata from mocap sequences",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Duygu Ceylan, Wilmot Li, Niloy J. Mitra, Maneesh Agrawala,  Mark Paul",
   "Abstract": "We propose an automatic algorithm that takes a motion sequence of a humanoid character and generates the design for a mechanical figure that approximates the input motion when driven with a single input crank. Our approach has two stages. The motion approximation stage computes a motion that approximates the input sequence as closely as possible while remaining compatible with the geometric and motion constraints of the mechanical parts in our design.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2380190",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/mechanicalmocap.jpg"
 },
 {
   "ID": 165,
   "Year": 2013,
   "Title": "Cost-effective printing of 3D objects with skin-frame structures",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Weiming Wang, Tuanfeng Y. Wang, Zhouwang Yang, Ligang Liu, Xin Tong, Weihua Tong, Jiansong Deng, Falai Chen,  Xiuping Li",
   "Abstract": "3D printers have become popular in recent years and enable fabrication of custom objects for home users. However, the cost of the material used in printing remains high. In this paper, we present an automatic solution to design a skin-frame structure for the purpose of reducing the material cost in printing a given 3D object. The frame structure is designed by an optimization scheme which significantly reduces material volume and is guaranteed to be physically stable, geometrically approximate, and printable. Furthermore, the number of struts is minimized by solving an l0 sparsity optimization.  [...]",
   "DOI": "http://dx.doi.org/10.1145/2508363.2508382",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/wang_sga2013.jpg"
 },
 {
   "ID": 185,
   "Year": 2012,
   "Title": "3D-printing of non-assembly, articulated models",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Jacques Calì, Dan A. Calian, Cristina Amati, Rebecca Kleinberger, Anthony Steed, Jan Kautz,  Tim Weyric",
   "Abstract": "In this paper, we propose a method for converting 3D models into printable, functional, non-assembly models with internal friction. To this end, we have designed an intuitive work-flow that takes an appropriately rigged 3D model, automatically fits novel 3D-printable and posable joints, and provides an interface for specifying rotational constraints. We show a number of results for different articulated models, demonstrating the effectiveness of our method.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2366149",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/articulatedparts.jpg"
 },
 {
   "ID": 186,
   "Year": 2012,
   "Title": "Chopper: partitioning models into 3D-printable parts",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Linjie Luo, Ilya Baran, Szymon Rusinkiewicz,  Wojciech Matusi",
   "Abstract": "3D printing technology is rapidly maturing and becoming ubiquitous. One of the remaining obstacles to wide-scale adoption is that the object to be printed must fit into the working volume of the 3D printer. We propose a framework, called Chopper, to decompose a large 3D object into smaller parts so that each part fits into the printing volume. These parts can then be assembled to form the original object.  [...]",
   "DOI": "hhttp://dl.acm.org/citation.cfm?id=2366148",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/chopper.jpg"
 },
 {
   "ID": 187,
   "Year": 2012,
   "Title": "Motion-guided mechanical toy modeling",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "Lifeng Zhu, Weiwei Xu, John Snyder, Yang Liu, Guoping Wang,  Baining Gu",
   "Abstract": "We introduce a new method to synthesize mechanical toys solely from the motion of their features. The designer specifies the geometry and a time-varying rotation and translation of each rigid feature component. Our algorithm automatically generates a mechanism assembly located in a box below the feature base that produces the specified motion. Parts in the assembly are selected from a parameterized set including belt-pulleys, gears, crank-sliders, quick-returns, and various cams (snail, ellipse, and double-ellipse). [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2366146",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/zhu_sga2012.jpg"
 },
 {
   "ID": 197,
   "Year": 2011,
   "Title": "Slices: a shape-proxy based on planar sections",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH ASIA",
   "Authors": "James McCrae, Karan Singh,  Niloy J. Mitr",
   "Abstract": "We explore the use of planar sections, i.e., the contours of intersection of planes with a 3D object, for creating shape abstractions, motivated by their popularity in art and engineering. We first perform a user study to show that humans do define consistent and similar planar section proxies for common objects. Interestingly, we observe a strong correlation between user-defined planes and geometric features of objects. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2024202",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/slices_sga2011.jpg"
 },
 {
   "ID": 206,
   "Year": 2010,
   "Title": "Physical Reproduction of Materials with Specified Subsurface Scattering",
   "Organization": "ACM",
   "Conference": "ACM SIGGRAPH",
   "Authors": "Milos Hasan, Martin Fuchs, Wojciech Matusik, Hanspeter Pfister,  Szymon Rusinkiewic",
   "Abstract": "We describe a mathematical model that predicts the profiles of different stackings of base materials, at arbitrary thicknesses. In an inverse process, we can then specify a desired reflection profile and compute a layered composite material that best approximates it. Our algorithm efficiently searches the space of possible combinations of base materials, pruning unsatisfactory states imposed by physical constraints. We validate our process by producing both homogeneous and heterogeneous composites fabricated using a multi-material 3D printer. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1778798",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/milos.jpg"
 },
 {
   "ID": 51,
   "Year": 2017,
   "Title": "Flexy: Shape-Customizable, Single-Layer, Inkjet Printable Patterns for 1D and 2D Flex Sensing",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Nirzaree Vadgama, Jürgen Steimle",
   "Abstract": "We contribute a new technique for fabricating highly customized 1D and 2D flex \n\tsensing surfaces on thin and flexible substrates. It enables designers and makers to easily, \n\tquickly and inexpensively realize thin physical objects in custom shapes with an embedded deformation sensor. \n\tThe deformation sensor is digitally designed and then fabricated with a \n\tsingle layer of conductive material in a single pass, using an off-the-shelf inkjet printer. [...]",
   "DOI": "https://doi.org/10.1145/3024969.3024989",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Vadgama_TEI2017.jpg"
 },
 {
   "ID": 133,
   "Year": 2015,
   "Title": "Scotty: Relocating Physical Objects Across Distances Using Destructive Scanning, Encryption, and 3D Printing",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Stefanie Mueller, Martin Fritzsche, Jan Kossmann, Maximilian Schneider, Jonathan Striebel,  Patrick Baudisc",
   "Abstract": "We present a simple self-contained appliance that allows relocating inanimate physical objects across distance. Each unit consists of an off-the-shelf 3D printer that we have extended with a 3-axis milling machine, a camera, and a micro-controller for encryption/decryption and transmission. Users see the object appear layer-by-layer on the receiver side as it disappears layer-by-layer at the sender side. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2680547",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/scotty.jpg"
 },
 {
   "ID": 134,
   "Year": 2015,
   "Title": "SPATA: Spatio-Tangible Tools for Fabrication-Aware Design",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Christian Weichel, Jason Alexander, Abhijit Karnik,  Hans Gellerse",
   "Abstract": "SPATA is the digital adaptation of two spatial measurement tools, that explores their closer integration into virtual design environments. We adapt two of the traditional measurement tools: calipers and protractors. Both tools can measure, transfer, and present size and angle. Their close integration into different design environments makes tasks more fluid and convenient. [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2680576",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/spata.jpg"
 },
 {
   "ID": 184,
   "Year": 2013,
   "Title": "Enclosed: a component-centric interface for designing prototype enclosures",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Christian Weichel, Manfred Lau,  Hans Gellerse",
   "Abstract": "This paper explores the problem of designing enclosures (or physical cases) that are needed for prototyping electronic devices. \n\tWe present a novel interface that uses electronic components as handles for designing the 3D shape of the enclosure. [...]",
   "DOI": "http://dx.doi.org/10.1145/2460625.2460659",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/enclosed_tei2013.jpg"
 },
 {
   "ID": 196,
   "Year": 2012,
   "Title": "DressUp: a 3D interface for clothing design with a physical mannequin",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Amy Wibowo, Daisuke Sakamoto, Jun Mitani,  Takeo Igarash",
   "Abstract": "This paper introduces DressUp, a computerized system for designing dresses with \n\t3D input using the form of the human body as a guide. It consists of a body-sized physical mannequin, \n\ta screen, and tangible prop tools for drawing in 3D on and around the mannequin. As the user draws, \n\the/she modifies or creates pieces of digital cloth, \n\twhich are displayed on a model of the mannequin on the screen.  [...]",
   "DOI": "http://dx.doi.org/10.1145/2148131.2148153",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/dressup_tei2012.jpg"
 },
 {
   "ID": 202,
   "Year": 2011,
   "Title": "SketchChair: an all-in-one chair design system for end users",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Greg Saul, Manfred Lau, Jun Mitani,  Takeo Igarash",
   "Abstract": "SketchChair is an application that allows novice users to control the entire process of designing and building their own chairs. Chairs are designed using a simple 2D sketch-based interface and design validation tools, and are then fabricated from sheet materials, cut by a laser cutter or CNC milling machine.   [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1935717",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/sketchchair.jpg"
 },
 {
   "ID": 207,
   "Year": 2010,
   "Title": "Spatial sketch: bridging between movement & fabrication",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Karl D.D. Willis, Juncong Lin, Jun Mitani,  Takeo Igarash",
   "Abstract": "This paper explores the rationale and details behind the development of the Spatial Sketch application, \n\tand presents our observations from user testing and a hands-on lamp shade design workshop. \n\tFinally we reflect upon the relevance of \n\tembodied forms of human computer interaction for use in digital fabrication. [...]",
   "DOI": "http://dx.doi.org/10.1145/1709886.1709890",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/spatialsketch_tei2010.jpg"
 },
 {
   "ID": 9,
   "Year": 2017,
   "Title": "iSoft: A Customizable Soft Sensor with Real-time Continuous Contact and Stretching Sensing",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Sang Ho Yoon, Ke Huo, Yunbo Zhang, Guiming Chen, Luis Paredes, Subramanian Chidambaram,  Karthik Raman",
   "Abstract": "We present iSoft, a single volume soft sensor capable of sensing real-time continuous contact and unidirectional stretching. We propose a low-cost and an easy way to fabricate such piezoresistive elastomer-based soft sensors for instant interactions. We employ an electrical impedance tomography (EIT) technique to estimate changes of resistance distribution on the sensor caused by fingertip contact. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3126594.3126654",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yoon_UIST2017.JPG"
 },
 {
   "ID": 10,
   "Year": 2017,
   "Title": "StrutModeling: A Low-Fidelity Construction Kit to Iteratively Model, Test, and Adapt 3D Objects",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Danny Leen, Raf Ramakers, Kris Luyte",
   "Abstract": "We present StrutModeling, a computationally enhanced construction kit that enables users without a 3D modeling background to prototype 3D models by assembling struts and hub primitives in physical space. Physical 3D models are immediately captured in software and result in readily available models for 3D printing. Given the concrete physical format of StrutModels, modeled objects can be tested and fine tuned in the presence of existing objects and specific needs of users. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3126594.3126643",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Danny_UIST2017.JPG"
 },
 {
   "ID": 11,
   "Year": 2017,
   "Title": "BlowFab: Rapid Prototyping for Rigid and Reusable Objects using Inflation of Laser-cut Surfaces",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Junichi Yamaoka, Ryuma Niiyama, Yasuaki Kakeh",
   "Abstract": "This study proposes BlowFab, a prototyping method used to create a 2.5-dimensional prototype in a short time by combining laser cutting and blow molding techniques. The user creates adhesive areas and inflatable areas by engraving and cutting multilayered plastic sheets using a laser cutter. These adhesive areas are fused automatically by overlapping two crafted sheets and softening them with a heater. The user can then create hard prototypes by injecting air into the sheets. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3126594.3126624",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Junichi_UIST2017.JPG"
 },
 {
   "ID": 12,
   "Year": 2017,
   "Title": "AirCode: Unobtrusive Physical Tags for Digital Fabrication",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Dingzeyu Li, Avinash S. Nair, Shree K. Nayar, Changxi Zhen",
   "Abstract": "We present AirCode, a technique that allows the user to tag physically fabricated objects with given information. An AirCode tag consists of a group of carefully designed air pockets placed beneath the object surface. These air pockets are easily produced during the fabrication process of the object, without any additional material or postprocessing. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3126594.3126635",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Dingzeyu_UIST2017.jpg"
 },
 {
   "ID": 13,
   "Year": 2017,
   "Title": "FoamSense: Design of Three Dimensional Soft Sensors with Porous Materials",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Satoshi Nakamaru, Ryosuke Nakayama, Ryuma Niiyama,  Yasuaki Kakeh",
   "Abstract": "This sensor is made by impregnating a porous soft object with conductive ink. The design process of FoamSense is explained. We then summarized the features and basic characteristics of some porous materials for designing these sensors appropriately. We also proposed the potential of using digital fabrication for controlling the carrier structure of FoamSense. Proposed porous structure showed an anisotropic sensor characteristic. We discussed the potential and limitation of this approach. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3126594.3126666",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Satoshi_UIST2017.JPG"
 },
 {
   "ID": 64,
   "Year": 2016,
   "Title": "Stretchis: Fabricating Highly Stretchable User Interfaces",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Michael Wessely, Theophanis Tsandilas,  Wendy E. Mackay",
   "Abstract": "We use Polydimethylsiloxan (PDMS) as the base material for a Stretchi and show how to embed stretchable touch and proximity sensors and stretchable electroluminescent displays. \n\tStretchis can be ultra-thin (≈ 200μm), flexible, and fully customizable, enabling non-expert makers to add interaction to elastic physical objects, shape-changing surfaces, fabrics, and the human body. \n\t[...]",
   "DOI": "https://doi.org/10.1145/2984511.2984521",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Wessely_UIST2016.jpg"
 },
 {
   "ID": 65,
   "Year": 2016,
   "Title": "Digital Gastronomy: Methods & Recipes for Hybrid Cooking",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Moran Mizrahi, Amos Golan, Ariel Bezaleli Mizrahi, Rotem Gruber, Alexander Zoonder Lachnise, Amit Zoran",
   "Abstract": "We envision a culture of Digital Gastronomy that enhances traditional cooking \n\twith new interactive capabilities, rather than replacing the chef with an autonomous machine. \n\tThus, we deploy existing digital fabrication instruments in traditional kitchen and integrate \n\tthem into cooking via hybrid recipes. This concept merges manual and digital procedures, \n\tand imports parametric design tools into cooking, \n\tallowing the chef to personalize the tastes, flavors, structures and aesthetics of dishes. [...]",
   "DOI": "https://doi.org/10.1145/2984511.2984528",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Mizrahi_UIST2016.jpg"
 },
 {
   "ID": 66,
   "Year": 2016,
   "Title": "Aesthetic Electronics: Designing, Sketching, and Fabricating Circuits through Digital Exploration",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Joanne Lo, Cesar Torres, Isabel Yang, Jasper O'Leary, Danny Kaufman, Wilmot Li, Mira Dontcheva, Eric Paulos",
   "Abstract": "Ellustrate guides users through the fabrication and debugging process, \n\teasing the task of practical circuit creation while supporting designers' aesthetic decisions \n\tthroughout the circuit authoring workflow. In a formal user study, we demonstrate how \n\tEllustrate enables a new electronic design conversation that combines electronics, materials, and visual aesthetic concerns. [...]",
   "DOI": "https://doi.org/10.1145/2984511.2984579",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Joanne_UIST2016.jpg"
 },
 {
   "ID": 67,
   "Year": 2016,
   "Title": "Mobile Fabrication",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Thijs Roumen, Bastian Kruck, Tobias Dürschmid, Tobias Nack,  Patrick Baudisc",
   "Abstract": "We present an exploration into the future of fabrication, in particular the vision of mobile fabrication, which we define as \"personal fabrication on the go\". \n\tFrom our experience with the prototypes we derive hardware requirements to make mobile fabrication also technically feasible. [...]",
   "DOI": "https://doi.org/10.1145/2984511.2984586",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/mobilefab_uist2016.jpg"
 },
 {
   "ID": 68,
   "Year": 2016,
   "Title": "Metamaterial Mechanisms",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen,  Patrick Baudisc",
   "Abstract": "In order to allow users to create metamaterial mechanisms efficiently we implemented a specialized 3D editor. It allows users to place different types of cells, including the shear cell, thereby allowing users to add mechanical functionality to their objects. To help users verify their designs during editing, our editor allows users to apply forces and simulates how the object deforms in response. [...]",
   "DOI": "https://doi.org/10.1145/2984511.2984540",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/metamaterial_uist2016.jpg"
 },
 {
   "ID": 69,
   "Year": 2016,
   "Title": "A 3D Printer for Interactive Electromagnetic Devices",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Huaishu Peng, François Guimbretière, James McCann,  Scott Hudso",
   "Abstract": "We introduce a new form of low-cost 3D printer to print interactive electromechanical objects with wound in place coils. \n\tAt the heart of this printer is a mechanism for depositing wire within a five degree of freedom (5DOF) \n\tfused deposition modeling (FDM) 3D printer. Copper wire can be used with this mechanism to form coils which \n\tinduce magnetic fields as a current is passed through them. [...]",
   "DOI": "https://doi.org/10.1145/2984511.2984523",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Huaishu_UIST2016.jpg"
 },
 {
   "ID": 103,
   "Year": 2015,
   "Title": "Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Valkyrie Savage, Sean Follmer, Jingyi Li, Björn Hartman",
   "Abstract": "We aim to allow makers to design and 3D print functional mechanical and electronic assemblies. \n\tBased on a formative exploration, we created Makers' Marks, a system based on physically authoring assemblies with sculpting materials and annotation stickers. \n\tMakers physically sculpt the shape of an object and attach stickers to place existing parts or high-level features (such as parting lines). [...]",
   "DOI": "https://doi.org/10.1145/2807442.2807508",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Savage_UIST2015.jpg"
 },
 {
   "ID": 104,
   "Year": 2015,
   "Title": "ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Christian Weichel, John Hardy, Jason Alexander,  Hans Gellerse",
   "Abstract": "To provide a more flexible design process that allows objects to iteratively evolve through \n\tboth digital and physical input, we introduce bidirectional fabrication. To demonstrate the concept, \n\twe built ReForm, a system that integrates digital modeling with shape input, shape output, \n\tannotation for machine commands, and visual output. [...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807451",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/reform_uist2015.jpg"
 },
 {
   "ID": 105,
   "Year": 2015,
   "Title": "LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert,  Patrick Baudisc",
   "Abstract": "We propose eliminating the assembly step with our system LaserStacker. \n\tThe key idea is to use the laser cutter to not only cut but also to weld. \n\tUsers place not one acrylic sheet, but a stack of acrylic sheets into their cutter. [...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807512",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/laserstacker_uist2015.jpg"
 },
 {
   "ID": 106,
   "Year": 2015,
   "Title": "HapticPrint: Designing Feel Aesthetics for Digital Fabrication",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Cesar Torres, Tim Campbell, Neil Kumar,  Eric Paulo",
   "Abstract": "We present HapticPrint as a pair of design tools to easily modify the feel of a 3D model. \n\tOur external tool maps textures and UI elements onto arbitrary shapes, \n\tand our internal tool modifies the internal geometry of models for novel compliance and weight characteristics. \n\tWe demonstrate the value of HapticPrint with a range of applications that expand the aesthetics of feel, usability, and interactivity in 3D artifacts. \n\t[...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807492",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/hapticprint_uist2015.png"
 },
 {
   "ID": 107,
   "Year": 2015,
   "Title": "Patching Physical Objects",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert,  Patrick Baudisc",
   "Abstract": "In this paper, we propose a different approach: instead of re-printing the entire object from scratch, we suggest patching the existing object to reflect the next design iteration. \n\tSince only a fraction of the entire object is refabricated, our approach reduces material consumption and plastic waste (for our example objects by 82% and 93% respectively). [...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807467",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/patching_uist2015.jpg"
 },
 {
   "ID": 108,
   "Year": 2015,
   "Title": "RevoMaker: Enabling Multi-directional and Functionally-embedded 3D printing using a Rotational Cuboidal Platform",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Wei Gao, Yunbo Zhang, Diogo C. Nazzetta, Karthik Ramani,  Raymond J. Cipr",
   "Abstract": "We present \"RevoMaker\", a self-contained 3D printer that creates direct out-of-the-printer functional prototypes, using less build material and with substantially less reliance on support structures. By modifying a standard low-cost FDM printer with a revolving cuboidal platform and printing partitioned geometries around cuboidal facets, we achieve a multidirectional additive prototyping process to reduce the print and support material use. [...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807476",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/revomaker_ust2015.jpg"
 },
 {
   "ID": 109,
   "Year": 2015,
   "Title": "Protopiper: Physically Sketching Room-Sized Objects at Actual Scale",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Harshit Agrawal, Udayan Umapathi, Robert Kovacs, Johannes Frohnhofen, Hsiang-Ting Chen, Stefanie Mueller, Patrick Baudisc",
   "Abstract": "Protopiper is a mechanical device that allows users to sketch room-sized objects at actual scale. The key idea behind protopiper is that it forms adhesive tape into tubes as its main building material, rather than extruded plastic or photopolymer lines. Since the resulting tubes are hollow they offer excellent strength-to-weight ratio, thus scale well to large structures.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2807505",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/protopiper.jpg"
 },
 {
   "ID": 110,
   "Year": 2015,
   "Title": "3D Printed Hair: Fused Deposition Modeling of Soft Strands, Fibers and Bristles",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Gierad Laput, Xiang 'Anthony' Chen,  Chris Harriso",
   "Abstract": "We introduce a technique for furbricating 3D printed hair, fibers and bristles, by exploiting the stringing phenomena inherent in 3D printers using fused deposition modeling. Our approach offers a range of design parameters for controlling the properties of single strands and also of hair bundles. [...]",
   "DOI": "http://dx.doi.org/10.1145/2807442.2807484",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/3dprintedhair_uist2015.jpg"
 },
 {
   "ID": 141,
   "Year": 2014,
   "Title": "A series of tubes: adding interactivity to 3D prints using internal pipes",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice,  Björn Hartman",
   "Abstract": "We investigate how 3D models can be modified to facilitate the creation of interactive objects that offer dynamic input and output. We introduce a general technique for supporting \n\tthe rapid prototyping of interactivity by removing interior material from 3D models to form internal pipes. \n\tWe describe this new design space of pipes for interaction design, where variables include openings, path constraints, topologies, and inserted media. \n\t[...]",
   "DOI": "http://dx.doi.org/10.1145/2642918.2647374",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/tubes_uist2014.png"
 },
 {
   "ID": 142,
   "Year": 2014,
   "Title": "FlatFitFab: interactive modeling with planar sections",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "James McCrae, Nobuyuki Umetani,  Karan Sing",
   "Abstract": "We present a comprehensive system to author planar section structures, common in art and engineering. \n\tA study on how planar section assemblies are imagined and drawn guide our design principles: \n\tplanar sections are best drawn in-situ, with little foreshortening, \n\torthogonal to intersecting planar sections, exhibiting regularities between planes and contours. [...]",
   "DOI": "http://dx.doi.org/10.1145/2642918.2647388",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/flatfitfab_uist2014.jpg"
 },
 {
   "ID": 143,
   "Year": 2014,
   "Title": "WirePrint: 3D printed previews for fast prototyping",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière,  Patrick Baudisc",
   "Abstract": "With WirePrint, we propose to instead print low-fidelity wireframe previews in the early stages of the design process. \n\tWireframe previews are 3D prints in which surfaces have been replaced with a wireframe mesh. \n\tSince wireframe previews are to scale and represent the overall shape of the 3D object, \n\tthey allow users to quickly verify key aspects of their 3D design, such as the ergonomic fit. [...]",
   "DOI": "http://dx.doi.org/10.1145/2642918.2647359",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/wireprint_uist2014.jpg"
 },
 {
   "ID": 166,
   "Year": 2013,
   "Title": "Human-computer interaction for hybrid carving",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Amit Zoran, Roy Shilkrot,  Joseph Paradis",
   "Abstract": "In this paper we explore human-computer interaction for carving, building upon our previous work with \n\tthe FreeD digital sculpting device. We contribute a new tool design (FreeD V2), with a novel set of \n\tinteraction techniques for the fabrication of static models: \n\tpersonalized tool paths, manual overriding, and physical merging of virtual models. [...]",
   "DOI": "http://dx.doi.org/10.1145/2501988.2502023",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/freedv2_uist2013.jpg"
 },
 {
   "ID": 167,
   "Year": 2013,
   "Title": "Sauron: embedded single-camera sensing of printed physical user interfaces",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Valkyrie Savage, Colin Chang,  Björn Hartman",
   "Abstract": "We present Sauron, an embedded machine vision-based system for sensing human input on physical controls like buttons, sliders, and joysticks. \n\tWith Sauron, designers attach a single camera with integrated ring light to a printed prototype. [...]",
   "DOI": "http://dx.doi.org/10.1145/2501988.2501992",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/sauron_uist2013.jpg"
 },
 {
   "ID": 168,
   "Year": 2013,
   "Title": "PacCAM: material capture and interactive 2D packing for efficient material usage on CNC cutting machines",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Daniel Saakes, Thomas Cambazard, Jun Mitani,  Takeo Igarash",
   "Abstract": "In this paper, we introduce PacCAM, a system for packing 2D parts within a given source material \n\tfor fabrication using 2D cutting machines. Our solution combines computer vision to \n\tcapture the source material shape with a user interface that incorporates 2D rigid body simulation and snapping. [...]",
   "DOI": "http://dx.doi.org/10.1145/2501988.2501990",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/paccam_uist2013.jpg"
 },
 {
   "ID": 188,
   "Year": 2012,
   "Title": "Interactive Construction: Interactive Fabrication of Functional Mechanical Devices",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Stefanie Mueller, Pedro Lopes,  Patrick Baudisc",
   "Abstract": "Constructable is an interactive drafting table that produces precise physical output in every step. Users interact by drafting directly on the workpiece using a hand-held laser pointer. The system tracks the pointer, beautifies its path, and implements its effect by cutting the workpiece using a fast high-powered laser cutter.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2380191",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/constructable.jpg"
 },
 {
   "ID": 189,
   "Year": 2012,
   "Title": "Midas: fabricating custom capacitive touch sensors to prototype interactive objects",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Valkyrie Savage, Xiaohan Zhang,  Björn Hartman",
   "Abstract": "An increasing number of consumer products include user interfaces that rely on touch input. While digital fabrication techniques such as 3D printing make it easier to prototype the shape of custom devices, adding interactivity to such prototypes remains a challenge for many designers. We introduce Midas, a software and hardware toolkit to support the design, fabrication, and programming of flexible capacitive touch sensors for interactive objects.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2380189",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/midas.jpg"
 },
 {
   "ID": 190,
   "Year": 2012,
   "Title": "Printed optics: 3D printing of embedded optical elements for interactive devices",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Karl Willis, Eric Brockmeyer, Scott Hudson,  Ivan Poupyre",
   "Abstract": "An increasing number of consumer products include user interfaces that rely on touch input. While digital fabrication techniques such as 3D printing make it easier to prototype the shape of custom devices, adding interactivity to such prototypes remains a challenge for many designers. We introduce Midas, a software and hardware toolkit to support the design, fabrication, and programming of flexible capacitive touch sensors for interactive objects.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=2380190",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/printedoptics.jpg"
 },
 {
   "ID": 203,
   "Year": 2010,
   "Title": "CopyCAD: remixing physical objects with copy and paste from the real world",
   "Organization": "ACM",
   "Conference": "ACM UIST",
   "Authors": "Sean Follmer, David Carr, Emily Lovell,  Hiroshi Ishi",
   "Abstract": "This paper introduces a novel technique for integrating geometry from physical objects into computer aided design (CAD) software. We allow users to copy arbitrary real world object geometry into 2D CAD designs at scale through the use of a camera/projector system. [...]",
   "DOI": "http://dx.doi.org/10.1145/1866218.1866230",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/copycad_uist2010.png"
 },
 {
   "ID": 8,
   "Year": 2017,
   "Title": "Edible retroreflector",
   "Organization": "ACM",
   "Conference": "ACM VRST",
   "Authors": "Takahiro Uji, Yiting Zhang,  Hiromasa Ok",
   "Abstract": "This paper proposes an edible retroreflector made from transparent foodstuffs. We found that kanten, or Japan agar, which is a traditional Japanese cooking ingredient used to form a transparent jelly, was suitable for forming such optical devices. A recipe for an edible retroreflector using kanten was developed. A prototype made from kanten showed a retroreflective function in reflectance measurement experiments. \n\t[...]",
   "DOI": "https://doi.org/10.1145/3139131.3139148",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Uji_VRST2017.jpg"
 },
 {
   "ID": 195,
   "Year": 2012,
   "Title": "Laser cooking: a novel culinary technique for dry heating using a laser cutter and vision technology",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Kentaro Fukuchi, Kazuhiro Jo, Akifumi Tomiyama, Shunsuke Taka",
   "Abstract": "We propose a novel cooking technology that uses a laser cutter as a dry-heating device. \n\tIn general, dry-heat cooking heats the whole surface of an ingredient, while a laser cutter heats a small \n\tspot of the surface in a very short time. Our approach employs a computer-controlled laser cutter and a video \n\timage-processing technique to cook ingredients according to their shape and composition, allowing for new tastes, \n\ttextures, decorations, and engraving unique identifiers to the ingredients. [...]",
   "DOI": "https://doi.org/10.1145/2390776.2390788",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Fukuchi_CEA2012.jpg"
 },
 {
   "ID": 16,
   "Year": 2017,
   "Title": "Computing interior support-free structure via hollow-to-fill construction",
   "Organization": "COMPUTER AND GRAPHICS",
   "Conference": "COMPUTER AND GRAPHICS",
   "Authors": "Yang Yang, Shuangming Chai, Xiao-Ming F",
   "Abstract": "Given a voxelized model and the optimization goal, we first hollow out the model until it becomes a shell, whose thickness is determined by the physical material properties, and then add the support-free structures to optimize the inner surface, and finally refine the inner surface from bottom to top to minimize the optimization objective while maintaining the support-free property. \n\tFurthermore, shape deformation and extra weights are also utilized to optimize the shape for design goals. \n\t[...]",
   "DOI": "https://doi.org/10.1016/j.cag.2017.07.005",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Yang_CG2017.jpg"
 },
 {
   "ID": 17,
   "Year": 2017,
   "Title": "Personalized food printing for portrait images",
   "Organization": "COMPUTER AND GRAPHICS",
   "Conference": "COMPUTER AND GRAPHICS",
   "Authors": "Haiming Zhao, Jufeng Wang, Xiaoyu Ren, Jingyuan Li, Yong-Liang Yang, Xiaogang Ji",
   "Abstract": "Our framework automatically converts an arbitrary input image into an optimized printable path to facilitate food printing, while preserving the prominent features of the image. \n\tThis is achieved based on two key stages. \n\tFirst, we apply image abstraction techniques to extract salient image features. \n\tRobust face detection and sketch synthesis are optionally involved to enhance face features for portrait images. \n\t[...]",
   "DOI": "https://doi.org/10.1016/j.cag.2017.07.012",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Zhao_CG2017.jpg"
 },
 {
   "ID": 183,
   "Year": 2013,
   "Title": "Orthogonal slicing for additive manufacturing",
   "Organization": "COMPUTER AND GRAPHICS",
   "Conference": "COMPUTER AND GRAPHICS",
   "Authors": "Kristian Hildebrand, Bernd Bickel,  Marc Alex",
   "Abstract": "Our approach then finds a compromise between modeling each part of the shape individually in \n\tthe best possible direction and using one direction for the whole shape part. \n\tIn particular, we compute an orthogonal \n\tbasis and consider only the three basis vectors as slice normals (i.e. fabrication directions). [...]",
   "DOI": "http://www.sciencedirect.com/science/article/pii/S009784931300085X",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/orthogonal_cg2013.jpg"
 },
 {
   "ID": 82,
   "Year": 2016,
   "Title": "Balancing 3D models with movable masses",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Romain Prévost, Moritz Bächer, Wojciech Jarosz, Olga Sorkine-Hornun",
   "Abstract": "e present an algorithm to balance 3D printed models using movable embedded masses. \n\tAs input, the user provides a 3D model together with the desired suspension, standing, \n\tand immersion objectives. Our technique then determines the placement and suitable sizing \n\tof a set of hollow capsules with embedded metallic spheres, \n\tleveraging the resulting multiple centers of mass to simultaneously satisfy the combination of these objectives. [...]",
   "DOI": "https://doi.org/10.2312/vmv.20161337",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Romain_EG2016.jpg"
 },
 {
   "ID": 50,
   "Year": 2017,
   "Title": "Digital Fabrication Techniques for Cultural Heritage: A Survey",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Roberto Scopigno, Paolo Cignoni, Nico Pietroni, Marco Callieri, Matteo Dellepiane",
   "Abstract": "This survey overviews the various fabrication technologies, discussing their strengths, limitations and costs. Various successful uses of 3D printing in the Cultural Heritage are analysed, which should also be useful for other application contexts. We review works that have attempted to extend fabrication technologies in order to deal with the specific issues in the use of digital fabrication in the Cultural Heritage. Finally, we also propose areas for future research. [...]",
   "DOI": "http://onlinelibrary.wiley.com/doi/10.1111/cgf.12781/full",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Scopigno_SDC2017.jpg"
 },
 {
   "ID": 83,
   "Year": 2016,
   "Title": "Buoyancy Optimization for Computational Fabrication",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Lingfeng Wang,  Emily Whitin",
   "Abstract": "This paper introduces a design and fabrication pipeline for creating floating forms. Our method optimizes for buoyant equilibrium and stability of complex 3D shapes, applying a voxel-carving technique to control the mass distribution. \n\tThe resulting objects achieve a desired floating pose defined by a user-specified waterline height and orientation. [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12810",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/buoyancy_eg2016.jpg"
 },
 {
   "ID": 84,
   "Year": 2016,
   "Title": "Saliency-Preserving Slicing Optimization for Effective 3D Printing",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Weiming Wang, Haiyuan Chao, Jing Tong, Zhouwang Yang, Xin Tong, Hang Li, Xiuping Liu,  Ligang Li",
   "Abstract": "We present an adaptive slicing scheme for reducing the manufacturing time for 3D printing systems. \n\tBased on a new saliency-based metric, our method optimizes the thicknesses of slicing layers to \n\tsave printing time and preserve the visual quality of the printing results. We formulate the problem as a \n\tconstrained optimization and compute the slicing result via a two-step optimization scheme.  [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12527",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/saliency_eg2016.jpg"
 },
 {
   "ID": 157,
   "Year": 2014,
   "Title": "PackMerger: A 3D Print Volume Optimizer",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Bedrich Benes, Juraj Vanek, Jorge A. Garcia Galicia, Radomir Mech, Nathan A. Carr, Ondrej Stava, Gavin S. P. Miller",
   "Abstract": "Our PackMerger framework converts\n\tthe input 3D watertight mesh into a shell by hollowing its inner parts. The shell is then divided into segments. The\n\tlocation of splits is controlled based on several parameters, including the size of the connection areas or volume\n\tof each segment. The pieces are then tightly packed using optimization. [...]",
   "DOI": "http://onlinelibrary.wiley.com/doi/10.1111/cgf.12353/abstract",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Bedrich_CFG2014.jpg"
 },
 {
   "ID": 158,
   "Year": 2014,
   "Title": "Interlocking pieces for printing tangible cultural heritage replicas",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Giuseppe Alemanno, Paolo Cignoni, Nico Pietroni, Federico Ponchio, Roberto Scopign",
   "Abstract": "We propose a technique to decompose a 3D digital shape into a set of interlocking pieces that are easy to \n\tbe manufactured and assembled. The pieces are designed so that they can be represented as a simple height \n\tfield and, therefore, they can be manufactured by common 3D printers without the usage of supporting material. \n\tThe removal of \n\tthe supporting material is often a burdensome task and may eventually damage the surface of the printed object. [...]",
   "DOI": "https://doi.org/10.2312/gch.20141312",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Giuseppe_EG2014.jpg"
 },
 {
   "ID": 159,
   "Year": 2014,
   "Title": "Dual-color mixing for fused deposition modeling printers",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Tim Reiner, Nathan Carr, Radomír Mêch, Ondrej St'ava, Carsten Dachsbacher,  Gavin Mille",
   "Abstract": "In this work we detail a method that leverages the two color heads of recent low-end fused deposition modeling FDM 3D printers to produce continuous tone imagery. \n\tThe key insight behind our work is that by applying small geometric offsets, tone can be varied without the need to switch color print heads within a single layer. \n\t[...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12319",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/dualcolor_eg2014.jpg"
 },
 {
   "ID": 160,
   "Year": 2014,
   "Title": "Clever Support: Efficient Support Structure Generation for Digital Fabrication",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Juraj Vanek, Jorge A. G. Galicia,  Bedrich Bene",
   "Abstract": "We present a novel, geometry-based approach that minimizes the support material while providing sufficient support. \n\tUsing our approach, the input 3D model is first oriented into a position with minimal area that requires support. \n\tThen the points in this area that require support are detected. [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12437",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cleversupport_eg2014.jpg"
 },
 {
   "ID": 180,
   "Year": 2013,
   "Title": "Fabrication-aware Design with Intersecting Planar Pieces",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Yuliy Schwartzburg,  Mark Paul",
   "Abstract": "We propose a computational design approach to generate 3D models composed of interlocking planar pieces. \n\tWe show how intricate 3D forms can be created by sliding the pieces into each other along straight slits, \n\tleading to a simple construction that does not require glue, screws, or other means of support.  [...]",
   "DOI": "http://dx.doi.org/10.1111/cgf.12051",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/fabricationaware_eg2013.png"
 },
 {
   "ID": 181,
   "Year": 2013,
   "Title": "Computing and Fabricating Multiplanar Models",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Desai Chen, Pitchaya Sitthi-amorn, Justin T. Lan,  Wojciech Matusi",
   "Abstract": "Our shape approximation algorithm iteratively assigns mesh faces to planar segments and slowly deforms these faces towards corresponding segments. This approach ensures that the output for a given closed mesh is still a closed mesh and avoids introducing self-intersections. [...]",
   "DOI": "https://diglib.eg.org/handle/10.1111/v32i2pp305-315",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/multiplanar_eg2013.jpg"
 },
 {
   "ID": 182,
   "Year": 2013,
   "Title": "Computational Fabrication and Display of Material Appearance",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Aatthias B. Hullin, Ivo Ihrke, Wolfgang Heidrich, Tim Weyrich, Gerwin Damberg, Martin Fuch",
   "Abstract": "In this report, we summarize research efforts from the worlds of fabrication display, and categorize the different approaches into a common taxonomy. We believe that this report can serve as a basis for systematic exploration of the design space in future research.  [...]",
   "DOI": "hhttps://diglib.eg.org/handle/10.2312/conf.EG2013.stars.137-153",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/computa_eg2013.jpeg"
 },
 {
   "ID": 211,
   "Year": 2009,
   "Title": "Interactive Cover Design Considering Physical Constraints",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS",
   "Authors": "Yuki Igarashi, Takeo Igarashi,  Hiromasa Suzuk",
   "Abstract": "We developed an interactive system to design a customized cover for a given three-dimensional (3D) \n\tobject such as a camera, teapot, or car. The system first computes the convex hull of the input geometry. \n\tThe user segments it into several cloth patches by drawing on the 3D surface. [...]",
   "DOI": "http://dx.doi.org/10.1111/j.1467-8659.2009.01575.x",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/icdcp_eg2009.jpg"
 },
 {
   "ID": 200,
   "Year": 2011,
   "Title": "GOAL-BASED CAUSTICS",
   "Organization": "EUROGRAPHICS",
   "Conference": "EUROGRAPHICS ",
   "Authors": "Marios Papas, Wojciech Jarosz, Wenzel Jakob, Szymon Rusinkiewicz, Wojciech Matusik, Tim Weyrich",
   "Abstract": "We propose a novel system for designing and manufacturing surfaces that produce desired caustic images when illuminated by a light source. Our system is based on a nonnegative image decomposition using a set of possibly overlapping anisotropic Gaussian kernels. We utilize this decomposition to construct an array of continuous surface patches, each of which focuses light onto one of the Gaussian kernels, either through refraction or reflection.  [...]",
   "DOI": "http://onlinelibrary.wiley.com/doi/10.1111/j.1467-8659.2011.01876.x/abstract",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Marios_CGF2011.jpg"
 },
 {
   "ID": 161,
   "Year": 2013,
   "Title": "3D-Printing Spatially Varying BRDFs",
   "Organization": "IEEE",
   "Conference": "IEEE COMPUTER GRAPHICS AND APPLICATIONS",
   "Authors": "Olivier Rouiller, Bernd Bickel, Wojciech Matusik, Marc Alexa,  Jan Kaut",
   "Abstract": "A new method fabricates custom surface reflectance and spatially varying bidirectional reflectance \n\tdistribution functions (svBRDFs). Researchers optimize a microgeometry for a \n\trange of normal distribution functions and simulate the resulting surface's effective reflectance. [...]",
   "DOI": "http://dx.doi.org/10.1109/MCG.2013.82",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/cdpsv_cganda2013.jpg"
 },
 {
   "ID": 138,
   "Year": 2014,
   "Title": "The Wise Chisel: The Rise of the Smart Handheld Tool",
   "Organization": "IEEE",
   "Conference": "IEEE Pervasive Computing",
   "Authors": "Amit Zoran, Roy Shilkrot, Pragun Goyal, Pattie Maes, Joseph A. Paradis",
   "Abstract": "Here, the authors offer a definition for smart handheld tools, discuss the tools' origins and motivation, and present a survey of prominent work by themselves and others in disciplines such as fabrication, painting, printing, and maintenance. They also discuss their experiences operating in this new territory and conclude with a vision of a hybrid creative practice: smart handheld instruments that enable synergetic cooperation with human skill, personal style, and computational assistance that results in accuracy, guidance, and protection for users. [...]",
   "DOI": "https://doi.org/10.1109/MPRV.2014.59",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Amit_pc2014.jpg"
 },
 {
   "ID": 52,
   "Year": 2017,
   "Title": "New possibilities using additive manufacturing with materials that are difficult to process and with complex structures",
   "Organization": "IOPScience",
   "Conference": "IOPScience",
   "Authors": "Anders Olsson, Maja S Hellsing, Adrian R Renni",
   "Abstract": "We illustrate process developments with an account of the production of printer parts to cope with polymer fillers that are hard and abrasive; new nozzles with ruby inserts designed for such materials are durable and can be used to print boron carbide composites. As with other materials, complex parts can be printed using boron carbide composites with fine structures, such as screw threads and labels to identify materials.  [...]",
   "DOI": "http://iopscience.iop.org/article/10.1088/1402-4896/aa694e",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/Anders_iop2017.jpg"
 },
 {
   "ID": 208,
   "Year": 2010,
   "Title": "Designing Custommade Metallophone with Concurrent Eigenanalysis",
   "Organization": "NIME",
   "Conference": "NIME",
   "Authors": "Nobuyuki Umetani, Kenshi Takayama, Jun Mitani,  Takeo Igarash",
   "Abstract": "We introduce an interactive interface for the custom design of metallophones. \n\tThe shape of each plate must be determined \n\tin the design process so that the metallophone will produce the proper tone when struck with a mallet. \n\tOur system addresses this problem by running a concurrent numerical eigenanalysis during interactive geometry editing. [...]",
   "DOI": "http://www.jst.go.jp/erato/igarashi/projects/metallophone/2010-nime.pdf",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/metallophone_nime2010.jpg"
 },
 {
   "ID": 201,
   "Year": 2011,
   "Title": "Interactive fabrication: new interfaces for digital fabrication",
   "Organization": "ACM",
   "Conference": "ACM TEI",
   "Authors": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin,  Mark D. Gros",
   "Abstract": "We present a series of prototype devices that use real-time input to fabricate physical form: Interactive Fabrication. Our work maps out the problem space of real-time control for digital fabrication devices, and examines where alternative interfaces for digital fabrication are relevant. We conclude by reflecting upon the potential of interactive fabrication and outline a number of considerations for future research in this area.  [...]",
   "DOI": "http://dl.acm.org/citation.cfm?id=1935716",
   "Thumbtail": "http://hcie.csail.mit.edu/fabpub/img/interactivefabrication.jpg"
 }
]